{
  "timestamp": "2020-01-24T21:37:22.805Z",
  "collections": [
    {
      "name": "AcademicPlanCollection",
      "contents": [
        {
          "slug": "ba-botany-2019",
          "degreeSlug": "ba-botany",
          "name": "B.A. in Botany (2019)",
          "description": "The Bachelor of Arts in Botany is a liberal arts degree with an emphasis on understanding modern concepts in plant sciences, particularly related to the role of botany in society and the uniqueness of the ecology of Hawai’i. The BA degree provides students flexibility to pursue a broad liberal arts education, and still gain a sound foundation in botany with an area of particular interest.",
          "academicTerm": "Fall-2019",
          "coursesPerAcademicTerm": [
            3,
            2,
            0,
            4,
            0,
            0,
            2,
            3,
            0,
            2,
            3,
            0
          ],
          "choiceList": [
            "bot_100-1",
            "biol_171-1",
            "biol_171l-1",
            "bot_101-1",
            "bot_101l-1",
            "bot_200-1",
            "bot_201-1",
            "bot_201l-1",
            "bot_elective-1",
            "bot_300,sust_310-1",
            "bot_305,biol_305-1",
            "group_1_elective-1",
            "bot_elective-2",
            "bot_elective-3",
            "group_2_elective-1",
            "bot_elective-4",
            "bot_400-1",
            "bot_420-1",
            "bot_elective-5"
          ],
          "groups": {
            "bot_100": {
              "name": "BOT 100",
              "courseSlugs": ["bot_100"]
            },
            "biol_171": {
              "name": "BIOL 171",
              "courseSlugs": ["biol_171"]
            },
            "biol_171l": {
              "name": "BIOL 171L",
              "courseSlugs": ["biol_171l"]
            },
            "bot_101": {
              "name": "BOT 111",
              "courseSlugs": ["bot_101"]
            },
            "bot_101l": {
              "name": "BOT 101L",
              "courseSlugs": ["bot_101l"]
            },
            "bot_200": {
              "name": "BOT 200",
              "courseSlugs": ["bot_200"]
            },
            "bot_201": {
              "name": "BOT 201",
              "courseSlugs": ["bot_201"]
            },
            "bot_201l": {
              "name": "BOT 201L",
              "courseSlugs": ["bot_201l"]
            },
            "bot_elective": {
              "name": "BOT Elective",
              "courseSlugs": ["bot_302", "bot_399", "bot_401", "bot_440", "bot_442", "bot_446", "sust_445", "bot_446", "bot_450"]
            },
            "bot_300,sust_310": {
              "name": "BOT 300/SUST 310",
              "courseSlugs": ["bot_300", "sust_310"]
            },
            "bot_305,biol_305": {
              "name": "BOT 305/BIOL 305",
              "courseSlugs": ["bot_305", "biol_305"]
            },
            "group_1_elective": {
              "name": "Group 1 Elective",
              "courseSlugs": ["bot_430", "bot_461", "bot_462", "bot_480"]
            },
            "group_2_elective": {
              "name": "Group 2 Elective",
              "courseSlugs": ["bot_301", "bot_310", "bot_350", "bot_440", "bot_444", "bot_450", "bot_454", "bot_456", "sust_313"]
            },
            "bot_400": {
              "name": "BOT 400",
              "courseSlugs": ["bot_400"]
            },
            "bot_420": {
              "name": "BOT 420",
              "courseSlugs": ["bot_420"]
            }
          },
          "retired": false
        }
      ]
    },
    {
      "name": "AcademicTermCollection",
      "contents": [
        {
          "term": "Spring",
          "year": 2015,
          "retired": false
        },
        {
          "term": "Summer",
          "year": 2015,
          "retired": false
        },
        {
          "term": "Fall",
          "year": 2015,
          "retired": false
        },
        {
          "term": "Spring",
          "year": 2016,
          "retired": false
        },
        {
          "term": "Summer",
          "year": 2016,
          "retired": false
        },
        {
          "term": "Fall",
          "year": 2016,
          "retired": false
        },
        {
          "term": "Spring",
          "year": 2017,
          "retired": false
        },
        {
          "term": "Summer",
          "year": 2017,
          "retired": false
        },
        {
          "term": "Fall",
          "year": 2017,
          "retired": false
        },
        {
          "term": "Spring",
          "year": 2018,
          "retired": false
        },
        {
          "term": "Summer",
          "year": 2018,
          "retired": false
        },
        {
          "term": "Fall",
          "year": 2018,
          "retired": false
        },
        {
          "term": "Spring",
          "year": 2019,
          "retired": false
        },
        {
          "term": "Summer",
          "year": 2019,
          "retired": false
        },
        {
          "term": "Fall",
          "year": 2019,
          "retired": false
        },
        {
          "term": "Spring",
          "year": 2020,
          "retired": false
        },
        {
          "term": "Summer",
          "year": 2020,
          "retired": false
        },
        {
          "term": "Fall",
          "year": 2020,
          "retired": false
        },
        {
          "term": "Spring",
          "year": 2021,
          "retired": false
        },
        {
          "term": "Summer",
          "year": 2021,
          "retired": false
        },
        {
          "term": "Fall",
          "year": 2021,
          "retired": false
        },
        {
          "term": "Spring",
          "year": 2022,
          "retired": false
        },
        {
          "term": "Summer",
          "year": 2022,
          "retired": false
        },
        {
          "term": "Fall",
          "year": 2022,
          "retired": false
        }
      ]
    },
    {
      "name": "AdminProfileCollection",
      "contents": [
        {
          "username": "radgrad@hawaii.edu",
          "firstName": "RadGrad",
          "lastName": "Admin"
        }
      ]
    },
    {
      "name": "AdvisorLogCollection",
      "contents": []
    },
    {
      "name": "AdvisorProfileCollection",
      "contents": [
        {
          "username": "glau@hawaii.edu",
          "firstName": "Gerald",
          "lastName": "Lau",
          "picture": "/images/mockup/glau.jpg",
          "website": "",
          "interests": [
            "application-development",
            "it-management",
            "security",
            "teaching"
          ],
          "careerGoals": [
            "graduate-school",
            "information-security-analyst",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "cmoore@hawaii.edu",
          "firstName": "Cam",
          "lastName": "Moore",
          "picture": "/images/mockup/cmoore.jpg",
          "website": "",
          "interests": [
            "research",
            "software-engineering"
          ],
          "careerGoals": [
            "devops-engineer"
          ],
          "retired": false
        }
      ]
    },
    {
      "name": "CareerGoalCollection",
      "contents": [
        {
          "name": "Data Scientist",
          "slug": "data-scientist",
          "interests": [
            "algorithms",
            "data-science",
            "databases",
            "machine-learning",
            "research"
          ],
          "description": "A data scientist analyzes and interprets extremely complex and large data sets, typically in order to assist an organization in its decision making.  Unlike traditional database engineers, data scientists must manage Big Data, which is typified by the following \"Three V's\":\n\n* Volume: from hundreds of millions to hundreds of billions of data points;\n* Velocity: data may arrive at high speed and must be dealt with in a timely manner; \n* Variety: data can range from structured to unstructured, and maybe be buggy or incomplete.\n\nCompanies like LinkedIn, Intuit, GE, Google, Zynga, and Netflix all employ data scientists to support their services.  The skills and tools used by a data scientist are extensive, and include:\n\n  * Languages, including a statistical programming language like R or Python and a database querying language like SQL. \n  * Statistical knowledge, including statistical tests, distributions, maximum likelihood estimators, etc. \n  * Machine learning methods, including k-nearest neighbors, random forests, and ensemble methods.\n  * Mathematics, including basic multivariate calculus and linear algebra in case you need to customize machine learning libraries.\n  * Visualization and communication, including describing your findings to both technical and non-technical audiences and use of data visualization tools like ggplot and d3.js. \n\nTo prepare for the Data Scientist career path, you will want to be proficient with algorithms ([ICS 311](/explorer/courses/ics_311)) and machine learning techniques ([ICS 435](/explorer/courses/ics_435)). Obviously, you will want to take both database courses: [ICS 321](/explorer/courses/ics_321) and [ICS 421](/explorer/courses/ics_421). You may want to explore data visualization ([ICS 484](/explorer/courses/ics_484)).  A research project that involves machine learning and/or \"big data\" techniques will provide valuable experience. You might consider a summer internship with a company like LinkedIn or Google where you can work with data scientists directly.  \n\nFinally, if you are serious about becoming a data scientist, you should add [Graduate School](/explorer/career-goals/graduate-school) as a career goal.  Most data scientists have a Ph.D. in Computer Science or some other STEM discipline.\n\nData Scientist was named [one of the 14 best tech jobs in America](http://www.cio.com/article/3167568/it-skills-training/14-best-tech-jobs-in-america.html#slide2). [View more information here.](https://hbr.org/2012/10//explorer/career-goals/data-scientist-the-sexiest-job-of-the-21st-century/)",
          "retired": false
        },
        {
          "name": "Database Administrator",
          "slug": "database-administrator",
          "interests": [
            "application-development",
            "databases",
            "software-engineering"
          ],
          "description": "Companies, private organizations, and government agencies rely on database administrators (DBAs) to organize and monitor financial records, employee profiles, and other sensitive information. These professionals also work to improve security and efficiency through testing, regular evaluation, and routine modifications. \n\nDBAs may be employed in-house at larger firms or organizations, but an increasing number of these professionals are finding work at third-party companies that specialize in database services. \n\nYou will need to be experienced with a variety of database platforms including MySQL, Oracle, and DB2.  \n\nDBAs typically do not work with \"Big Data\", which requires a different set of skills associated with the [data scientist](/explorer/career-goals/data-scientist) career goal.\n\nIf you want to prepare for jobs in database administration, you will want to take both academicTerms of Databases ([ICS 321](/explorer/courses/ics_321) and [ICS 421](/explorer/courses/ics_421)).  Networking and security classes will also be important preparation.\n\nDatabase Administrator was named [one of the 14 best tech jobs in America](http://www.cio.com/article/3167568/it-skills-training/14-best-tech-jobs-in-america.html#slide6). [View more information here.](http://www.bls.gov/ooh/computer-and-information-technology/database-administrators.htm)",
          "retired": false
        },
        {
          "name": "DevOps Engineer",
          "slug": "devops-engineer",
          "interests": [
            "application-development",
            "databases",
            "networks",
            "software-engineering"
          ],
          "description": "\"DevOps\" (short for \"development operations\") is a new and important specialization within software engineering. It refers to tools, technologies, and development processes in support of high speed application design, implementation, deployment, evolution, and scaling.  Put more simply, a DevOps engineer makes sure that business systems get deployed fast, stay up under heavy loads, are not hacked (or can be fixed quickly if hacked), and can be updated without loss of downtime. \n\nAccording to the [2015 State of DevOps report](http://puppetlabs.com/2015-devops-report), organizations using DevOps deploy code up to 30 times more frequently with 50% less deployment failures than those who do not.\n\nTo prepare for a career in DevOps, you need to start with software engineering ([ICS 314](/explorer/courses/ics_314)).  Build on that base with coursework in databases ([ICS 321](/explorer/courses/ics_321)) and networks ([ICS 351](/explorer/courses/ics_351)).  Finally, put all of that together with experience deploying applications in real-world, high stress situations.  That requires finding a summer internship where you can shadow experienced DevOps engineers as they do their daily work.\n\nDevOps Engineer was named [one of the 10 hottest developer jobs in 2017](http://www.techrepublic.com/article/the-10-hottest-developer-jobs-of-2017/). [View more information here.](https://puppet.com/blog/what-a-devops-engineer)",
          "retired": false
        },
        {
          "name": "Full Stack Developer",
          "slug": "full-stack-developer",
          "interests": [
            "databases",
            "software-engineering",
            "web-development"
          ],
          "description": "Full Stack Developer is a career goal focused on the design and implementation of web applications.  \"Full stack\" refers to a broad skill set that starts with front-end user interface design using a CSS framework such as Twitter Bootstrap or Semantic UI, proceeds through business logic implementation using Java, Javascript, Python, Ruby, C#, or some other programming language, and concludes with the design and implementation of a back-end database system using SQL, MongoDB, or some other variant.   \n\nIn addition, full stack developers must ensure that the application performs appropriately across multiple devices (laptops, tablets, and mobile). Full stack developers must often ensure that their design is scalable as usage increases.  \n\nTo prepare for this career goal, supplement your skills acquired inSoftware Engineering ([ICS 314](/explorer/courses/ics_314)) with other coursework including Databases ([ICS 321](/explorer/courses/ics_321)) and (perhaps) Design for Mobile Devices ([ICS 466](/explorer/courses/ics_466)). You might also want to do a summer internship with a business doing web application development to hone your skills and obtain experience in a \"real-world\" application development setting.\n\nFull Stack Developer was named one of the [Top 5 Hot IT Jobs in 2017](https://www.randstadusa.com/jobs/career-resources/hot-jobs-2017/best-in-demand-information-technology-jobs/). [View more information here.](http://www.bls.gov/ooh/computer-and-information-technology/web-developers.htm)",
          "retired": false
        },
        {
          "name": "Game Developer",
          "slug": "game-developer",
          "interests": [
            "computer-graphics",
            "databases",
            "game-design",
            "unity",
            "virtual-reality"
          ],
          "description": "The Game Developer career goal refers to a specialized form of Software Developer who focuses on game design and implementation. This is a challenging career path as it is both highly competitive and, depending upon the game, can require advanced skills including one or more of: graphic design, physics, algorithms, networking, UI design, hardware, device driver and OS-level programming, and the appropriate use of game mechanics to provide an entertaining and/or educational experience.   That said, being a Game Developer is totally cool and you should totally go for it.\n\nAs the above paragraph indicates, game development in general involves an intimidating level of both breadth and depth in knowledge.  But you don't need to know everything to get started.  To be well prepared for this career goal, it helps to start by developing a solid analytical background through coursework in math, physics, and algorithms ([ICS 311](/explorer/courses/ics_311)), then add solid programming skills including high level (software engineering ([ICS 3114](/explorer/courses/ics_314))) and low-level ([ICS 312](/explorer/courses/ics_312)), plus databases ([ICS 321](/explorer/courses/ics_321)).  If you are interested in designing games involving an AI, then you'll want basic AI ([ICS 361](/explorer/courses/ics_361)) as well as AI for Games ([ICS 462](/explorer/courses/ics_462)).  Cap it off with Video Game Design and Development ([ICS 485](/explorer/courses/ics_485)). \n\nYou should also take advantage of opportunities outside of the classroom to experience game development, such as the yearly Global Game Jam.  There are often summer internships at companies doing game design that can provide invaluable \"real-world\" experience and help you decide if this career path is for you. [View more information here.](http://study.com/articles/Game_Developer_Job_Description_Duties_and_Requirements.html)",
          "retired": false
        },
        {
          "name": "Graduate School",
          "slug": "graduate-school",
          "interests": [
            "research"
          ],
          "description": "Let's be frank: if you are considering a long-term career in computer science, then graduate school should one of your career goals.  This doesn't mean you need to go right back to school after you graduate; many if not most graduate students in computer science spent at least a few years working before returning to school. But obtaining an M.S. or Ph.D. in Computer Science at some point can open up many new opportunities in your professional career. \n\nThe basic difference between an M.S. and Ph.D. degree is \"scientific contribution\".  An M.S. degree enables you to obtain more advanced skills in any of the CS disciplines.  M.S. programs are typically two years long.  A Ph.D. degree adds the requirement that you develop a dissertation that documents a scientific contribution: some entirely new knowledge about computer science. The Ph.D. degree typically requires at least two to four additional years after the M.S. degree.  \n\nTo prepare to include graduate school at some point after you graduate, the most important thing to do is to plan one or more academicTerms where you participate in a research project with a professor.  You can do this via [ICS 499](/explorer/courses/ics_499), or even on a volunteer basis as long as you devote sufficient time to the project. This is important for two reasons. First, successful participation demonstrates to the people who later review your graduate school application that you are able to do graduate-level work, which is usually more independent and research-related.  Second, it enables your professor to get to know you on a more personal level and in the context of an independent project, not just a few homework assignments.  This will enable your professor to write you a strong recommendation letter, which is crucial to getting accepted to graduate school. [View more information here.](http://www.ics.hawaii.edu/academics/graduate-degree-programs/so-you-want-to-apply-to-/explorer/career-goals/graduate-school/)",
          "retired": false
        },
        {
          "name": "Information Security Analyst",
          "slug": "information-security-analyst",
          "interests": [
            "databases",
            "networks",
            "security"
          ],
          "description": "In RadGrad, the \"information security analyst\" career goal is intended to cover the wide variety of security-related positions, including Security Analyst, Security Architect, Security Software Developer, Cryptanalyst, Security Engineer, Security Administrator, Cryptographer, and Security Consultant. \n\nSecurity professionals range from \"ethical hackers\" who probe and exploit security vulnerabilities in web-based applications and network systems to cryptographers who analyze and decrypt hidden information from cyber-terrorists. There are jobs in security in virtually every industry, as well as in government. \n\nThe ICS degree  program offers many opportunities to develop security-related expertise.  We offer the [Security Science Focus](http://www.ics.hawaii.edu/academics/undergraduate-degree-programs/) which includes [ICS 355](/explorer/courses/ics_355), [ICS 455](/explorer/courses/ics_455), and (for motivated undergraduates) ICS 655.  We offer two courses related to Information Assurance ([ICS 425](/explorer/courses/ics_425) and [ICS 426](/explorer/courses/ics_426)).  You will also want to take at least one course in networking and one course in databases.\n\nIf you are interested in a career in security, we also recommend that you participate in [ICS GreyHats](http://www.ics.hawaii.edu/community/community-profile-the-ics-grey-hats/), a student club providing a venue for networking with industry and government, performing community service, and practical application of security skills in a supportive environment.\n\nFinally, the ICS Department sponsors a variety of security-related hackathons and contests every year. These also provide important learning opportunities in security.\n\nSecurity Engineer (a synonym for Information Security Analyst) was named one of the [Top 5 Hot IT Jobs in 2017](https://www.randstadusa.com/jobs/career-resources/hot-jobs-2017/best-in-demand-information-technology-jobs/). [View more information here.](http://www.bls.gov/ooh/computer-and-information-technology/information-security-analysts.htm)",
          "retired": false
        },
        {
          "name": "Information System Manager",
          "slug": "information-system-manager",
          "interests": [
            "it-management"
          ],
          "description": "The Information System Manager career goal combines computer science with business management.  In RadGrad, Information Systems Manager is an umbrella term for a variety of positions such as Chief Information Officer, Chief Technology Officer, and IT or MIS Director.  \n\nDepending upon the specific position, your responsibilities will include planning and coordination of computer-related business functions,  defining technology strategy, and/or evaluating new technology. The positions tend to involve supervision of other employees and determining the financial implications and business risks of your decisions.\n\nAs an undergrad, you can prepare for this career goal by enrolling in both computer science and business classes.  If your interests skew heavily toward the management side, you might consider transferring to the [Information Technology Management program](http://shidler.hawaii.edu/itm) in the School of Business. \n\nYou might also consider pursuing our [B.A. in ICS](http://www.ics.hawaii.edu/academics/undergraduate-degree-programs/ba-ics/). This choice provides more curricular freedom to support a combination of computer science and business courses. \n\nBe aware: this career goal is highly competitive.  If you are serious about it, then the best preparation is to first obtain a [B.S. in Computer Science](http://www.ics.hawaii.edu/academics/undergraduate-degree-programs/bs-ics/) or [B.S. in Computer Engineering](http://www.ics.hawaii.edu/academics/undergraduate-degree-programs/bs-ce/), and follow that with a Masters degree in Business Administration.  You do not have to go directly to graduate school: you can obtain your undergraduate degree, work for a few years, and then obtain your MBA. [View more information here.](http://www.bls.gov/ooh/management/computer-and-information-systems-managers.htm)",
          "retired": false
        },
        {
          "name": "IoT Architect",
          "slug": "iot-architect",
          "interests": [
            "algorithms",
            "computer-architecture",
            "data-science",
            "data-visualization",
            "databases",
            "hardware",
            "hci",
            "networks",
            "security"
          ],
          "description": "The [Internet of Things](https://en.wikipedia.org/wiki/Internet_of_things) (IoT) refers to the expansion of internet connectivity beyond traditional \"computers\" to other devices including refrigerators, cars,  houses, water heaters, solar panels, light bulbs, irrigation systems, heart monitoring implants, thermostats, etc.  These devices typically include sensors (to obtain data about their environment) as well as actuators (so they can act within their environment with behaviors).  The emerging IoT provides tremendous opportunities for improved decision making and efficiency, as well as tremendous security risks. \n\nTo pursue the IoT architect career goal, it helps to become familiar with hardware design ([ICS 331](/explorer/courses/ics_331)), software engineering ([ICS 314](/explorer/courses/ics_314)), networks ([ICS 311](/explorer/courses/ics_311)), databases ([ICS 321](/explorer/courses/ics_321)), security ([ICS 355](/explorer/courses/ics_355)), and visualization ([ICS 484](/explorer/courses/ics_484)).  Outside opportunities like [HI Capacity](/explorer/opportunities/hicapacity) and the [AT&T IoT Focused Hackathon](/explorer/opportunities/att-iot-hackathon) can provide you with practical exposure to IoT technologies.  [How to Become an IoT Developer: Six Tips](http://www.techrepublic.com/article/how-to-become-an-iot-developer-6-tips/) is useful reading.\n\nIoT architect was named one of the [Top 5 Hot IT Jobs in 2017](https://www.randstadusa.com/jobs/career-resources/hot-jobs-2017/best-in-demand-information-technology-jobs/). [View more information here.](https://en.wikipedia.org/wiki/Internet_of_things)",
          "retired": false
        },
        {
          "name": "Mobile App Developer",
          "slug": "mobile-app-developer",
          "interests": [
            "android",
            "mobile",
            "ios"
          ],
          "description": "The Mobile App Developer career path refers to a specialized software developer who can build \"native\" mobile applications for the Android and/or iOS operating systems.  \n\nTo prepare for this career path, begin with solid software development skills through coursework in software engineering ([ICS 314](/explorer/courses/ics_314)), networking ([ICS 351](/explorer/courses/ics_351)), and databases ([ICS 321](/explorer/courses/ics_321)).  You'll also want to take Design for Mobile Devices ([ICS 466](/explorer/courses/ics_466)).  \n\nIn addition to coursework, you'll want to develop specialized skills for your platform of choice: Android development involves a variant of Java, while modern iOS development involves the Swift programming language. You might want to take a summer course through Udacity or Coursera to augment your ICS preparation.\n\nFinally, if you want a career in mobile application development, don't wait to get started!   There's nothing preventing you from building a few applications and releasing them in the Android or iOS app stores.  If nothing else, they can be presented as part of your professional portfolio when you are interviewing for a job.  In the best case scenario, you might make a few bucks.\n\nMobile App Developer was named [one of the 10 hottest developer jobs in 2017](http://www.techrepublic.com/article/the-10-hottest-developer-jobs-of-2017/). [View more information here.](http://www.tomsitpro.com/articles/become-/explorer/career-goals/mobile-app-developer,1-2219.html)",
          "retired": false
        },
        {
          "name": "Network Engineer",
          "slug": "network-engineer",
          "interests": [
            "hardware",
            "networks"
          ],
          "description": "In RadGrad, the Network Engineer career goal also refers to positions such as Network Administrator, Network Architect, Network Manager, and Wireless Network Engineer.\n\nIn all cases, this career goal involves the design, construction, and maintenance of data communication networks, including local area networks (LANs), wide area networks (WANs), and intranets, wired or wireless. Such networks could range from simple connections between a set of offices to large-scale cloud infrastructures serving millions of people. \n\nConsider this career goal if you are comfortable and interested in work that combines design and decision-making about both software and hardware.    If your interests lean heavily toward the hardware side, you might want to consider the [B.S. in Computer Engineering](http://www.ics.hawaii.edu/academics/undergraduate-degree-programs/bs-ce/) degree.\n\nTo prepare for this career goal, you will want to take courses in both networking (such as [ICS 351](/explorer/courses/ics_351) and [ICS 451](/explorer/courses/ics_451)) and hardware ([ICS 331](/explorer/courses/ics_331)). To augment the traditional curriculum, consider an Independent Study  ([ICS 499](/explorer/courses/ics_499)) in a research project involving networking. [View more information here.](http://www.bls.gov/ooh/computer-and-information-technology/computer-network-architects.htm)",
          "retired": false
        },
        {
          "name": "Research Scientist",
          "slug": "research-scientist",
          "interests": [
            "research"
          ],
          "description": "The Research Scientist career goal is for those who want to prepare, quite simply, to invent the future. In RadGrad, the research scientist career goal represents job positions that typically require a Ph.D., such as \"Professor\" (in academia) or \"Research Scientist\" (in industry).  \n\nResearch scientists design, implement, and evaluate new approaches to computing and computing technology, and apply those approaches to solving significant problems in business, medicine, science, and other fields. Research scientists have the highest level of autonomy of any career goal; you are hired by an organization with the expectation that you will define and organize your work yourself (while within the general business or academic constraints of the organization).  Research scientists can often wear jeans and a t-shirt to work, because you will be evaluated almost totally on your ability to innovate. \n\nTo prepare to become a research scientist, you should also have [graduate school](/explorer/career-goals/graduate-school) as a career goal, and you should plan to (eventually) get a Ph.D. That said, you don't have to go to graduate school immediately: you might decide after graduation to first join or create a startup company based upon an idea you had as an undergraduate.  Successful research scientists have a tolerance for risk: not all research ideas are successful (if you can guarantee in advance that an idea will be successful, then by definition it no longer involves research).\n\nIf this career goal appeals to you, get involved with one (or more) research projects as an undergraduate.  This will both give you a taste for the work and enable you to develop connections with professors that will help when you eventually apply to graduate school.  If possible, try to publish a paper while you are an undergraduate. Your professor can help you to make that happen. [View more information here.](http://www.bls.gov/ooh/computer-and-information-technology/computer-and-information-research-scientists.htm)",
          "retired": false
        },
        {
          "name": "Robotics Engineer",
          "slug": "robotics-engineer",
          "interests": [
            "hardware",
            "robotics",
            "software-engineering"
          ],
          "description": "The robotics engineer career path involves the design of hardware and associated software to create automated systems to accomplish physical tasks that humans cannot or prefer not to do. The range of applications for Robotics Engineers is quite wide: from self-driving vacuum cleaners ([Roomba](https://store.irobot.com/default/robot-vacuum-roomba/)) to self-driving cars ([Tesla's autopilot](https://www.tesla.com/autopilot)).  Robotics engineers also work on drones, automated factory equipment, and other hardware systems involving autonomous behavior.\n\nTo prepare for the Robotics Engineer career path, most students will want to pursue the [B.S. in Computer Engineering](http://www.ics.hawaii.edu/academics/undergraduate-degree-programs/bs-ce/) degree program. This degree program will give you a solid foundation in hardware design, including circuits, signals, and digital electronics. Helpful ICS coursework includes Machine-level Programming ([ICS 312](/explorer/courses/ics_312)), Software Design for Robotics ([ICS 452](/explorer/courses/ics_452)), and Computer Vision ([ICS 483](/explorer/courses/ics_483)). [View more information here.](https://www.sokanu.com/careers/robotics-engineer/)",
          "retired": false
        },
        {
          "name": "Software Developer",
          "slug": "software-developer",
          "interests": [
            "application-development",
            "software-engineering"
          ],
          "description": "Software Developer is probably the most common career goal for computer science students, at least initially. This career goal also includes position titles such as Developer, Software Engineer, Programmer, Coder, Software Architect, Business Application Programmer, Programmer Analyst, and so forth.  \n\nBecause of their popularity and because they require specialized software development skills, RadGrad also defines more specialized career goals that are related to Software Developer: [Mobile App Developer](/explorer/career-goals/mobile-app-developer), [Game Developer](/explorer/career-goals/game-developer), and [Full Stack Developer](/explorer/career-goals/full-stack-developer). If you're not sure what kind of development you want to do, then Software Developer is a good bet.\n\nIn general, software developers are responsible for designing computing programs, applications, and support systems. They meet with clients to discuss technological needs, and then develop software to addresses those demands.  Once initially implemented, software developers must modify and maintain the systems as business requirements for the software change.\n\nTo prepare for the software developer, you need strong programming and software engineering skills which is guaranteed by any of the ICS degree programs.  Beyond the classroom, you should participate in programming-related events like coding competitions and hackathons.  You should also consider a summer internship doing software development for a business in order to gain \"real-world\" experience prior to graduation.\n\nSoftware Engineer was named [one of the 14 best tech jobs in America](http://www.cio.com/article/3167568/it-skills-training/14-best-tech-jobs-in-america.html#slide9). [View more information here.](http://www.bls.gov/ooh/computer-and-information-technology/software-developers.htm)",
          "retired": false
        },
        {
          "name": "Startup Co-Founder",
          "slug": "startup-cofounder",
          "interests": [
            "entrepreneurship"
          ],
          "description": "According to [the wikipedia entry](https://en.wikipedia.org/wiki/Startup_company), a software company is *an entrepreneurial venture which is typically a newly emerged, fast-growing business that aims to meet a marketplace need by developing or offering an innovative product, process or service. A startup is usually a company such as a small business, a partnership or an organization designed to rapidly develop a scalable business model.*\n\nIf your career goal is to start a new high tech business, then you will want a solid foundation in computer science, but the specific courses depend upon the application domain.  You might want to combine this career goal with another, more application-specific goal, such as [game developer](/explorer/career-goals/game-developer) or [VR/AR Engineer](/explorer/career-goals/vr-ar-engineer). \n\nRegardless of the application domain, you will want to acquire an understanding of business issues in general and startup issues in particular. You will definitely want to participate in the [Shidler Business Plan Competition](/explorer/opportunities/shider-bpc), and you might also want to do one or more summer internships to get a better sense of how technology development is shaped by market and organizational forces. [View more information here.](https://en.wikipedia.org/wiki/Startup_company)",
          "retired": false
        },
        {
          "name": "Teacher",
          "slug": "teacher",
          "interests": [
            "teaching"
          ],
          "description": "Teaching often appears in lists of [the top 10 most satisfying careers](http://www.careercast.com/jobs-rated/whistling-while-you-work-10-most-satisfying-careers), and it's easy to see why: you are helping others, you are benefitting society, and you get summers off, among [other things](https://www.buzzfeed.com/mrloganrhoades/the-24-best-parts-about-being-a-teacher?utm_term=.arAKJwPVrG#.txpklaR2Bx).\n\nIf you are interested in teaching high school computer science, we recommend that you complete either the B.A. or B.S. in computer science degree program, then plan to obtain a [Certificate in Secondary Education](https://coe.hawaii.edu/academics/institute-teacher-education/pbc-secondary).  This certificate can be obtained in 18 months after graduation, and you can take classes in the evening or online. \n\nYou don't have to wait until you obtain a teaching certificate to get started teaching. Consider programs such as [Teach for America](https://hawaii.teachforamerica.org/teaching-here). In addition, many private schools in Hawaii do not require a teaching certificate. [View more information here.](http://tobecomeateacher.org/becoming-a-cs-teacher/)",
          "retired": false
        },
        {
          "name": "UX Designer",
          "slug": "ux-designer",
          "interests": [
            "computer-graphics",
            "data-visualization",
            "hci",
            "web-development"
          ],
          "description": "The UX (User Experience) Designer career goal refers to jobs that involve the evaluation and improvement of usability, accessibility, and pleasure in the interaction with a software application.  UX design is closely related to human-computer interaction design, but extends it by addressing all aspects of the product or service as experienced by users.\n\nTo prepare for this career goal, you will want to extend your foundation in computer science with preparation in human-computer interaction ([ICS 464](/explorer/courses/ics_464)), cognitive science ([ICS 469](/explorer/courses/ics_469)), and/or data visualization ([ICS 484](/explorer/courses/ics_484)). \n\nIf you are passionate about UX design, you may wish to pursue the [B.A. in ICS](http://www.ics.hawaii.edu/academics/undergraduate-degree-programs/ba-ics/) degree plan to leave room in your schedule for coursework in Psychology or Graphic Arts.\n\nUX Designer was named [one of the 10 hottest developer jobs in 2017](http://www.techrepublic.com/article/the-10-hottest-developer-jobs-of-2017/). [View more information here.](https://en.wikipedia.org/wiki/User_experience_design)",
          "retired": false
        },
        {
          "name": "VR/AR Engineer",
          "slug": "vr-ar-engineer",
          "interests": [
            "algorithms",
            "artificial-intelligence",
            "cognitive-science",
            "computer-graphics",
            "data-visualization",
            "game-design",
            "virtual-reality"
          ],
          "description": "Virtual Reality and Augmented Reality have the potential to fundamentally change how people interact with data, with their environment, and with each other. In the past few years, technological breakthroughs have included the ability to solve the \"motion sickness problem\" and the use smartphones and simple cardboard enclosures rather than expensive dedicated headsets.  The next ten years will see the application of VR and AR to many technology sectors. \n\nTo pursue the VR/AR engineer career goal, it helps to become familiar with hardware design ([ICS 331](/explorer/courses/ics_331)), algorithms ([ICS 311](/explorer/courses/ics_311)), and visualization ([ICS 484](/explorer/courses/ics_484)).  Outside opportunities like [ACM Manoa/VR](/explorer/opportunities/acm-manoa-vr) and the [Lava Lab](/explorer/opportunities/lava-lab) can provide you with practical exposure to VR technologies. \n\nVR/AR engineer was named one of the [Top 5 Hot IT Jobs in 2017](https://www.randstadusa.com/jobs/career-resources/hot-jobs-2017/best-in-demand-information-technology-jobs/). [View more information here.](https://www.monster.com/career-advice/article/virtual-reality-tech-land-a-job)",
          "retired": false
        }
      ]
    },
    {
      "name": "CourseCollection",
      "contents": [
        {
          "name": "Freshman Seminar",
          "shortName": "Freshman Seminar",
          "slug": "bot_100",
          "num": "BOT 100",
          "description": "Discussion of hot topics in botany, including conservation of rare plants, invasive species, marine botany, ethnobotany, poisonous plants, evolution in action, fungal networks, and careers in botany with emphasis on Hawaiian examples.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["bot_101,biol_171"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "General Botany",
          "shortName": "General Botany",
          "slug": "bot_101",
          "num": "BOT 101",
          "description": "Growth, functions, and evolution of plants; their relations to the environment and particularly to humans and human activities.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "General Botany Lab",
          "shortName": "General Botany Lab",
          "slug": "bot_101l",
          "num": "BOT 101L",
          "description": "Lab observations and experiments illustrating basic principles of plant biology.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["bot_101"],
          "prerequisites": [
            "bot_101"
          ],
          "retired": false
        },
        {
          "name": "Ethnobotany",
          "shortName": "Ethnobotany",
          "slug": "bot_105",
          "num": "BOT 105",
          "description": "Plants and their influence on culture and history including: plant domestication and agriculture; plant biogeography and human migration; plant use in religious, medical, and shamanic traditions; and cultural aspects of plant conservation.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Ethnobotany Lab",
          "shortName": "Ethnobotany Lab",
          "slug": "bot_105l",
          "num": "BOT 105L",
          "description": "Laboratory exercises, experiments, and analysis in ethnobotany.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Plants, People, and Culture",
          "shortName": "Plants, People, and Culture",
          "slug": "bot_107",
          "num": "BOT 107",
          "description": "Ethnobotany. Interactions between plants and people: use in religious, medical, and shamanic traditions; roles in cultural formation, destruction, and revolution; plant domestication and food systems; roles in human migration; cultural components of plant conservation.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Biodiversity: Evolution, Ecology, & Conservation",
          "shortName": "Biodiversity: Evolution, Ecology, & Conservation",
          "slug": "bot_110",
          "num": "BOT 110",
          "description": "Lecture exploring the range of Earth’s diversity, the evolutionary processes that generate it, the ecological roles it plays, the consequences of its loss, and the processes by which it can be conserved.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Biodiversity: Evolution, Ecology, & Conservation Laboratory",
          "shortName": "Biodiversity: Evolution, Ecology, & Conservation Lab",
          "slug": "bot_110l",
          "num": "BOT 110L",
          "description": "Laboratory and outdoor observations and experiments examining the range of biological diversity among the Earth’s species and ecosystems.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["bot_110"],
          "prerequisites": ["bot_110"],
          "retired": false
        },
        {
          "name": "Hawaiian Plants - Their Ecology and Cultural Significance",
          "shortName": "Hawaiian Plants - Their Ecology and Cultural Significance",
          "slug": "bot_130",
          "num": "BOT 130",
          "description": "Introduction to the native flora of Hawai‘i, its origin, evolution and ecology, and the observation, identification, and systematics of the Hawaiian flora.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Hawaiian Plants - Their Ecology and Cultural Significance Laboratory",
          "shortName": "Hawaiian Plants - Their Ecology and Cultural Significance Lab",
          "slug": "bot_130l",
          "num": "BOT 130L",
          "description": "The exploration of concepts and the process of science through hands-on experience in studying Hawaiian and introduced plants, their ecology, and cultural significance.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["bot_130"],
          "prerequisites": ["bot_130"],
          "retired": false
        },
        {
          "name": "Magical Mushrooms and Mystical Molds",
          "shortName": "Magical Mushrooms and Mystical Molds",
          "slug": "bot_135",
          "num": "BOT 135",
          "description": "Impact of fungi in nature and on humankind. Selected historical events in which fungi played a significant role, their activities as decomposers and pathogens, and their uses as sources for mind altering drugs in religious ceremonies and in food and beverage production in various societies.",
          "creditHrs": 3,
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Campus Plants",
          "shortName": "Campus Plants",
          "slug": "bot_160",
          "num": "BOT 160",
          "description": "Nontechnical course emphasizing recognition of the many interesting tropical plants seen on campus; origin, status in Hawai‘i, and cultural and economic uses of campus plants.",
          "creditHrs": 3,
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Plant Life in the Sea",
          "shortName": "Plant Life in the Sea",
          "slug": "bot_180",
          "num": "BOT 180",
          "description": "(3 Lec, 1-3-hr Lab) Combined lecture-lab to introduce common marine plants in Hawaiian coastal areas via discussion of morphology, growth, ecological functions and native/alien status. Field trips to observe plants in local habitats.",
          "creditHrs": 4,
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Sophomore Seminar",
          "shortName": "Sophomore Seminar",
          "slug": "bot_200",
          "num": "BOT 200",
          "description": "Presentations by faculty highlighting research in tropical ecosystems. Topics include alien species, biodiversity, ecosystem services, ethnobotany, marine ecology, plant-animal interactions, and systematics of Hawaiian species. Assigned reading and writing exercises from papers in current journals",
          "creditHrs": 1,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_101,biol_171"
          ],
          "retired": false
        },
        {
          "name": "Plant Evolutionary Diversity",
          "shortName": "Plant Evolutionary Diversity",
          "slug": "bot_201",
          "num": "BOT 201",
          "description": "Significance of evolutionary trends in the plant world, including reproductive, morphological, and life history adaptations by algae, fungi, and vascular plants.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": ["bot_201l"],
          "prerequisites": [
            "bot_101"
          ],
          "retired": false
        },
        {
          "name": "Plant Evolutionary Diversity Lab",
          "shortName": "Plant Evolutionary Diversity Lab",
          "slug": "bot_201l",
          "num": "BOT 201L",
          "description": "Lab exercises in the morphology and systematics of land plants, fungi, and algae.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["bot_201"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Conservation Ethics",
          "shortName": "Conservation Ethics",
          "slug": "bot_300",
          "num": "BOT 300",
          "description": "Introduction to and discussion of ethical issues associated with biodiversity, ecology, and conservation biology.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Conservation Ethics",
          "shortName": "Conservation Ethics",
          "slug": "sust_310",
          "num": "SUST 310",
          "description": "Introduction to and discussion of ethical issues associated with biodiversity, ecology, and conservation biology.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Plant Conservation Biology",
          "shortName": "Plant Conservation Biology",
          "slug": "sust_313",
          "num": "SUST 313",
          "description": "Introduction to the concepts and principles of plant conservation biology and to plant conservation-in-practice in Hawai‘i and elsewhere.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": ["sust_313l"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Plant Conservation Biology Lab",
          "shortName": "Plant Conservation Biology Lab",
          "slug": "sust_313l",
          "num": "SUST 313L",
          "description": "Introduction to approaches, methods, and analyses used in the study and practice of plant conservation, with an emphasis on experimental design and problem-solving. Includes both laboratory and field components.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["sust_313"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Plant Conservation Biology",
          "shortName": "Plant Conservation Biology",
          "slug": "bot_301",
          "num": "BOT 301",
          "description": "Introduction to the concepts and principles of plant conservation biology and to plant conservation-in-practice in Hawai‘i and elsewhere.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": ["bot_301l"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Plant Conservation Biology Lab",
          "shortName": "Plant Conservation Biology Lab",
          "slug": "bot_301l",
          "num": "BOT 301L",
          "description": "Introduction to approaches, methods, and analyses used in the study and practice of plant conservation, with an emphasis on experimental design and problem-solving. Includes both laboratory and field components.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["bot_301"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Grant Writing Seminar",
          "shortName": "Grant Writing Seminar",
          "slug": "bot_302",
          "num": "BOT 302",
          "description": " Provides three rounds of opportunities for grant writing associated with research in biodiversity, conservation biology, ecology, and plant systematics. Students will gain experience in peer review, grant cycles, and budget preparation.",
          "creditHrs": 2,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_301,sust_313"
          ],
          "retired": false
        },
        {
          "name": "Ecology",
          "shortName": "Ecology",
          "slug": "bot_305",
          "num": "BOT 305",
          "description": "General survey of the principles of ecology. Focus on processes influencing the distribution and abundance of organisms, interactions among organisms, and interactions between organisms and the environment.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_201,biol_171"
          ],
          "retired": false
        },
        {
          "name": "Field Botany",
          "shortName": "Field Botany",
          "slug": "bot_310",
          "num": "BOT 310",
          "description": "Combined lecturelaboratory with intensive field experience for observational and experimental field work in native/impacted Hawaiian ecosystems. Field experience typically held during spring break. Terrestrial, freshwater, and marine habitats considered.",
          "creditHrs": 5,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_305"
          ],
          "retired": false
        },
        {
          "name": "Resource Management and Conservation in Hawai'i",
          "shortName": "Resource Management and Conservation in Hawai‘i",
          "slug": "bot_350",
          "num": "BOT 350",
          "description": "Management of native Hawaiian organisms and terrestrial ecosystems with particular attention to strategies, planning, research, and management actions necessary to control alien influences and promote native species.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Introduction to Biology I",
          "shortName": "Introduction to Biology I",
          "slug": "biol_171",
          "num": "BIOL 171",
          "description": "Introductory biology for all life science majors. Cell structure and chemistry; growth, reproduction, genetics, evolution, viruses, bacteria, and simple eukaryotes.",
          "creditHrs": 3,
          "corequisites": ["biol_171l"],
          "interests": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Introduction to Biology I Lab",
          "shortName": "Introduction to Biology I Lab",
          "slug": "biol_171l",
          "num": "BIOL 171L",
          "description": "Laboratory to accompany 171.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["biol_171"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Introduction to Biology II",
          "shortName": "Introduction to Biology II",
          "slug": "biol_172",
          "num": "BIOL 172",
          "description": "Anatomy, physiology, and systematics of plants and animals; behavior; ecosystems, populations, and communities.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": ["biol_172l"],
          "prerequisites": [
            "biol_171"
          ],
          "retired": false
        },
        {
          "name": "Introduction to Biology II Lab",
          "shortName": "Introduction to Biology II Lab",
          "slug": "biol_172l",
          "num": "BIOL 172L",
          "description": "Laboratory to accompany 172.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["biol_172"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Ecology and Evolutionary Biology",
          "shortName": "Ecology and Evolutionary Biology",
          "slug": "biol_265",
          "num": "BIOL 265",
          "description": " Principles of ecology and evolution for life science majors stressing integrated approach and recent advance.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": ["biol_265l"],
          "prerequisites": [
            "biol_171"
          ],
          "retired": false
        },
        {
          "name": "IEcology and Evolutionary Biology Lab",
          "shortName": "Ecology and Evolutionary Biology Lab",
          "slug": "biol_265l",
          "num": "BIOL 265L",
          "description": "Laboratory to accompany 265.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["biol_265"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Ecology",
          "shortName": "Ecology",
          "slug": "biol_305",
          "num": "BIOL 305",
          "description": "General survey of the principles of ecology. Focus on processes influencing the distribution and abundance of organisms, interactions among organisms, and interactions between organisms and the environment.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "biol_171,bot_201"
          ],
          "retired": false
        },
        {
          "name": "Botanical Problems",
          "shortName": "Botanical Problems",
          "slug": "bot_399",
          "num": "BOT 399",
          "description": "Individualized directed research. Intended for upper division botany majors. Repeatable six times.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_101",
            "biol_172"
          ],
          "retired": false
        },
        {
          "name": "Senior Seminar",
          "shortName": "Senior Seminar",
          "slug": "bot_400",
          "num": "BOT 400",
          "description": "Current research themes in botany presented in discussion format; reading current research papers. Oral presentations of primary research. Repeatable one time. BOT majors only. Senior standing and consent.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Teaching Internship",
          "shortName": "Teaching Internship",
          "slug": "bot_401",
          "num": "BOT 401",
          "description": "Teaching Internship (TI) allows upper division undergraduates to experience assisting in laboratory courses for BOT 101, 105, 201, 202, 203, or other lab courses in Botany or peer-mentoring for BOT 100, as available. Repeatable one time. BOT majors only. CR/NC only.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_301,sust_313"
          ],
          "retired": false
        },
        {
          "name": "Plant Anatomy",
          "shortName": "Plant Anatomy",
          "slug": "bot_410",
          "num": "BOT 410",
          "description": "Structure of vascular plants; origin and differentiation of tissues; relation of structure to function.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": ["bot_410l"],
          "prerequisites": [
            "bot_201"
          ],
          "retired": false
        },
        {
          "name": "Plant Anatomy Lab",
          "shortName": "Plant Anatomy Lab",
          "slug": "bot_410l",
          "num": "BOT 410L",
          "description": "(1 3-hr Lab) Lab study of plant structure.",
          "creditHrs": 1,
          "interests": [],
          "corequisites": ["bot_410"],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Plant Form and Function",
          "shortName": "Plant Form and Function",
          "slug": "bot_420",
          "num": "BOT 420",
          "description": "Lecture/laboratory to examine the anatomy, physiology, morphology, and functional ecology of plants. Labs will develop skills in microscopy, experimental techniques for studying plant physiology, and basic functional ecology.",
          "creditHrs": 4,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_101,biol_171",
            "bot_201"
          ],
          "retired": false
        },
        {
          "name": "Mycology",
          "shortName": "Mycology",
          "slug": "bot_430",
          "num": "BOT 430",
          "description": "Morphology, physiology, ecology of fungi; their identification.",
          "creditHrs": 2,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_201",
            "biol_172"
          ],
          "retired": false
        },
        {
          "name": "Mycology Lab",
          "shortName": "Mycology Lab",
          "slug": "bot_430l",
          "num": "BOT 430L",
          "description": "Laboratory to accompany 430.",
          "creditHrs": 2,
          "interests": [],
          "corequisites": ["bot_430"],
          "prerequisites": ["bot_430"],
          "retired": false
        },
        {
          "name": "Advanced Ethnobotany",
          "shortName": "Advanced Ethnobotany",
          "slug": "bot_440",
          "num": "BOT 440",
          "description": "Advanced studies of plant uses in cultural contexts, focusing upon impacts of plant-culture interactions in development of cultures, cultivars, medicinals, ethnoecologies, ethics, and intellectual property. Lecture/discussion, term paper.",
          "creditHrs": 4,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_105,bot_107"
          ],
          "retired": false
        },
        {
          "name": "Medical Ethnobotany",
          "shortName": "Medical Ethnobotany",
          "slug": "bot_442",
          "num": "BOT 442",
          "description": "Survey and theory of plants used as medicines, cultural perspectives of herbal medicine, and the botanical/chemical basis of allopathic and naturopathic medicine. Lecture/discussion, term paper or project.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_461"
          ],
          "retired": false
        },
        {
          "name": "Ethnoecology and Conservation",
          "shortName": "Ethnoecology and Conservation",
          "slug": "bot_444",
          "num": "BOT 444",
          "description": " Ecological implications of cultural uses of plants. Examines the biological basis for, and ecological effects of traditional and local resource management systems.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_305,biol_265"
          ],
          "retired": false
        },
        {
          "name": "Ethnoecology and Conservation",
          "shortName": "Ethnoecology and Conservation",
          "slug": "sust_445",
          "num": "SUST 445",
          "description": " Ecological implications of cultural uses of plants. Examines the biological basis for, and ecological effects of traditional and local resource management systems.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_305,biol_265"
          ],
          "retired": false
        },
        {
          "name": "Hawaiian Ethnobotany",
          "shortName": "Hawaiian Ethnobotany",
          "slug": "bot_446",
          "num": "BOT 446",
          "description": "(2 Lec, 1 3-hr Lab) Methods and techniques of handling and identifying plant materials used by early Hawaiians and modern Hawaiians for house and canoe construction, clothing, household and fishing items, medicine, and food preparation. Reading, laboratory, and fieldwork.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_440"
          ],
          "retired": false
        },
        {
          "name": "Natural History of Hawaiian Islands",
          "shortName": "Natural History of Hawaiian Islands",
          "slug": "bot_450",
          "num": "BOT 450",
          "description": "Geography, geology, climatology, biotic environment of Pacific Basin and Hawaiian Islands; endemism and evolution in terrestrial and marine biota of islands. Pre: one semester of biological sciences at college level.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Plant Ecology and Environmental Measurements",
          "shortName": "Plant Ecology and Environmental Measurements",
          "slug": "bot_453",
          "num": "BOT 453",
          "description": "(2 Lec, 2 3-hr Lab) Influence of natural environments on plant behavior (autecology). A field-oriented course to complement 454. Field trips. Should precede 454.",
          "creditHrs": 4,
          "interests": [],
          "corequisites": [],
          "prerequisites": ["bot_101,biol_172"],
          "retired": false
        },
        {
          "name": "Plant Community Ecology",
          "shortName": "Plant Community Ecology",
          "slug": "bot_454",
          "num": "BOT 454",
          "description": "(2 Lec, 2 3-hr Lab) Covers selected topics in plant population and community ecology. Strong emphasis on how ecology is practiced as a science. Labs take advantage of working outdoors in local natural areas.",
          "creditHrs": 4,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Analysis of Biological Data",
          "shortName": "Analysis of Biological Data",
          "slug": "bot_455",
          "num": "BOT 455",
          "description": "Application of computers to analysis of biological data; preparation and storage, report production, database analysis procedures, univariate and bivariate statistical analyses.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": ["biol_172"],
          "retired": false
        },
        {
          "name": "Plant-Animal Interactions",
          "shortName": "Plant-Animal Interactions",
          "slug": "bot_456",
          "num": "BOT 456",
          "description": "Interdependence of plants and animals, emphasizing the influence of animals on plant fitness and evolution. Topics include pollination, fruit/seed dispersal, herbivory, and ant-plant mutualisms.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_201,biol_265"
          ],
          "retired": false
        },
        {
          "name": "Hawai'i: Center of the Pacific",
          "shortName": "Hawai'i: Center of the Pacific",
          "slug": "hwst_107",
          "num": "HWST 107",
          "description": "EAn introduction to the unique aspects of the native point of view in Hawai‘i and in the larger Pacific with regards to origins, language, religion, land, art, history, and modern issues.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [],
          "retired": false
        },
        {
          "name": "Hawaiian Perspective in Ahupua'a",
          "shortName": "Hawaiian Perspective in Ahupua'a",
          "slug": "hwst_207",
          "num": "HWST 207",
          "description": "Examination of the ahupua‘a system as it was conceptualized by the ancient Hawaiians, and exploration of its relevance in modern society; an introductory class to the malama ‘aina track designed to build critical writing skills. A-F only.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "hwst_107"
          ],
          "retired": false
        },
        {
          "name": "Malama 'Aina Resource Management Visual Technologies",
          "shortName": "Malama 'Aina Resource Management Visual Technologies",
          "slug": "hwst_307",
          "num": "HWST 307",
          "description": "Requires a broad set of knowledge systems. Will introduce students to a variety of visual technologies for use in resource management and the ethical application of these technologies.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "hwst_107"
          ],
          "retired": false
        },
        {
          "name": "Aloha Kanaloa-Marine Resources and Abundance",
          "shortName": "Aloha Kanaloa-Marine Resources and Abundance",
          "slug": "hwst_356",
          "num": "HWST 356",
          "description": "Undergraduate course exposing students to the resources and processes of the ocean, research, and management approaches, as well as a Hawaiian worldview of oceanic elements. Junior standing or higher.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "hwst_107"
          ],
          "retired": false
        },
        {
          "name": "'Aina Mauliola: Hawaiian Ecosystems",
          "shortName": "'Aina Mauliola: Hawaiian Ecosystems",
          "slug": "bot_457",
          "num": "BOT 457",
          "description": "Comprehensive analysis of traditional Hawaiian and modern resource management practices. Rigorous overview of the dominant physical and biological processes from the uplands to the oceans in Hawai‘i.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "hwst_207,hwst_307,hwst_356"
          ],
          "retired": false
        },
        {
          "name": "Natural Resource Issues and Ethics",
          "shortName": "Natural Resource Issues and Ethics",
          "slug": "bot_458",
          "num": "BOT 458",
          "description": "Overview of the history of land, resources and power in Hawai‘i; players and processes influencing land and natural resources policies today explored from Native Hawaiian and other viewpoints. Extensive use of case studies.",
          "creditHrs": 4,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "hwst_207,hwst_307,hwst_356"
          ],
          "retired": false
        },
        {
          "name": "Strategies in Hawaiian Resource Use",
          "shortName": "Strategies in Hawaiian Resource Use",
          "slug": "bot_459",
          "num": "BOT 459",
          "description": "Analyzing diverse land and water use strategies of O‘ahu, from traditional Hawaiian, scientific and economic perspectives, through classroom and on-site lectures. Topics include traditional Hawaiian methods, modern development, threatened ecosystems, ecotourism and scientific research. A-F only.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "hwst_207,hwst_307,hwst_356"
          ],
          "retired": false
        },
        {
          "name": "Hui Konokiki Internship: Applied Resource Management",
          "shortName": "Hui Konokiki Internship: Applied Resource Management",
          "slug": "bot_460",
          "num": "BOT 460",
          "description": "A “hands-on” internship in an environmental or resource-management organization in Hawai‘i. The experience will be broadened and supplemented by classroom lectures, discussion and analysis from traditional Hawaiian, scientific and economic perspectives. A-F only.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "hwst_207,hwst_307,hwst_356"
          ],
          "retired": false
        },
        {
          "name": "Systematics of Vascular Plants",
          "shortName": "Systematics of Vascular Plants",
          "slug": "bot_461",
          "num": "BOT 461",
          "description": "\"Hands-on\" experience with Hawai‘i’s unique tropical flora; emphasis on recognition and identification of vascular plant families and the principles and methodologies that define them; evolution of biodiversity.",
          "creditHrs": 4,
          "interests": [],
          "corequisites": [],
          "prerequisites":[
            "bot_101"
          ]
        },
        {
          "name": "Plant Evolution",
          "shortName": "Plant Evolution",
          "slug": "bot_462",
          "num": "BOT 462",
          "description": "Major events and principles; includes the blue-green algae and fungi.",
          "creditHrs": 4,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_201,biol_172"
          ],
          "retired": false
        },
        {
          "name": "Algal Diversity and Evolution",
          "shortName": "Algal Diversity and Evolution",
          "slug": "bot_480",
          "num": "BOT 480",
          "description": "Principles of algal diversity, structure, and evolution. Identification of common Hawaiian algae.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_101,biol_172"
          ],
          "retired": false
        },
        {
          "name": "Wildlife Ecology and Management in the Tropics",
          "shortName": "Wildlife Ecology and Management in the Tropics",
          "slug": "bot_492",
          "num": "BOT 492",
          "description": "Practices from around the world that focuses on the tropics. Integrates across disciplines, considers how science based management interacts with world views and considers management plans that are scientifically rigorous but culturally sensitive.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "biol_265"
          ],
          "retired": false
        },
        {
          "name": "Advanced Directed Research",
          "shortName": "Advanced Directed Research",
          "slug": "bot_499",
          "num": "BOT 499",
          "description": "Performance of research project under the direction of a faculty advisor. Preparation of written proposal, final oral presentation to be given to the Botany Department audience and written report required. Preference given to BOT majors. Repeatable up to eight credits. CR/NC only.",
          "creditHrs": 3,
          "interests": [],
          "corequisites": [],
          "prerequisites": [
            "bot_301,sust_313",
            "bot_302"
          ],
          "retired": false
        },
        {
          "name": "Non Botany Course",
          "shortName": "Non-Bot Course",
          "slug": "other",
          "num": "other",
          "description": "The course used to represent all non-Botany courses.",
          "creditHrs": 3,
          "interests": [],
          "prerequisites": [],
          "retired": false
        }
      ]
    },
    {
      "name": "CourseInstanceCollection",
      "contents": []
    },
    {
      "name": "DesiredDegreeCollection",
      "contents": [
        {
          "name": "Bachelor of Arts (BA) in Botany",
          "shortName": "BA in Botany",
          "slug": "ba-botany",
          "description": "The Bachelor of Arts in Botany is a liberal arts degree with an emphasis on understanding modern concepts in plant sciences, particularly related to the role of botany in society and the uniqueness of the ecology of Hawai’i. The BA degree provides students flexibility to pursue a broad liberal arts education, and still gain a sound foundation in botany with an area of particular interest.",
          "retired": false
        },
        {
          "name": "Bachelor of Science (BS) in Botany",
          "shortName": "BS in Botany",
          "slug": "bs-botany",
          "description": "The Bachelor of Science in Botany is designed for those students who plan a career in science with an emphasis on plants, especially those intending to do graduate studies. A full complement of basic courses in biology, chemistry, math, and physics is required in addition to botany courses.",
          "retired": false
        }
      ]
    },
    {
      "name": "FacultyProfileCollection",
      "contents": [
        {
          "username": "amend@hawaii.edu",
          "firstName": "Anthony",
          "lastName": "Amend",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "research-scientist"
          ],
          "retired": false
        },
        {
          "username": "kbarton@hawaii.edu",
          "firstName": "Kasey",
          "lastName": "Barton",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [
            "research"
          ],
          "careerGoals": [
            "research-scientist"
          ],
          "retired": false
        },
        {
          "username": "daehler@hawaii.edu",
          "firstName": "Curtis",
          "lastName": "Daehler",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "research-scientist"
          ],
          "retired": false
        },
        {
          "username": "dondrake@hawaii.edu",
          "firstName": "Donald",
          "lastName": "Drake",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "research-scientist"
          ],
          "retired": false
        },
        {
          "username": "dduffy@hawaii.edu",
          "firstName": "David",
          "lastName": "Duffy",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [],
          "retired": false
        },
        {
          "username": "honarvar@hawaii.edu",
          "firstName": "Shaya",
          "lastName": "Honarvar",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "research-scientist",
            "graduate-school"
          ],
          "retired": false
        },
        {
          "username": "nhynson@hawaii.edu",
          "firstName": "Nicole",
          "lastName": "Hynson",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "research-scientist",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "sterling@hawaii.edu",
          "firstName": "Sterling",
          "lastName": "Keeley",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "graduate-school",
            "research-scientist",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "merlin@hawaii.edu",
          "firstName": "Mark",
          "lastName": "Merlin",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "graduate-school",
            "research-scientist",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "cdmuir@hawaii.edu",
          "firstName": "Christopher",
          "lastName": "Muir",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "research-scientist",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "cmorden@hawaii.edu",
          "firstName": "Clifford",
          "lastName": "Morden",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "research-scientist",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "ranker@hawaii.edu",
          "firstName": "Tom",
          "lastName": "Ranker",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "graduate-school",
            "research-scientist",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "asherwoo@hawaii.edu",
          "firstName": "Alison",
          "lastName": "Sherwood",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "research-scientist",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "celia@hawaii.edu",
          "firstName": "Celia",
          "lastName": "Smith",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "graduate-school",
            "research-scientist"
          ],
          "retired": false
        },
        {
          "username": "asugi@hawaii.edu",
          "firstName": "Anna",
          "lastName": "Sugiyama",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "graduate-school",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "ticktin@hawaii.edu",
          "firstName": "Tamara",
          "lastName": "Ticktin",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "graduate-school",
            "research-scientist",
            "teacher"
          ],
          "retired": false
        },
        {
          "username": "gwong@hawaii.edu",
          "firstName": "George",
          "lastName": "Wong",
          "picture": "/images/default-profile-picture.png",
          "website": "",
          "interests": [],
          "careerGoals": [
            "graduate-school",
            "research-scientist",
            "teacher"
          ],
          "retired": false
        }
      ]
    },
    {
      "name": "FavoriteCareerGoalCollection",
      "contents": []
    },
    {
      "name": "FavoriteCourseCollection",
      "contents": []
    },
    {
      "name": "FavoriteInterestCollection",
      "contents": []
    },
    {
      "name": "FavoriteOpportunityCollection",
      "contents": []
    },
    {
      "name": "FeedCollection",
      "contents": []
    },
    {
      "name": "FeedbackInstanceCollection",
      "contents": []
    },
    {
      "name": "HelpMessageCollection",
      "contents": [
        {
          "routeName": "/advisor/:username/home",
          "title": "Learn About Student Configuration",
          "text": "You can add new students and edit existing students on this page.\n\n#### ADD NEW STUDENT\n\n<img class=\"ui medium left floated image\" src=\"/images/help/student-configuration-select-student-add-new.png\">\n\nIn the \"Select Student\" pane, click on \"Add New\" to register a new student with RadGrad.\n\n**Note:** All usernames must be unique.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n#### UPDATE EXISTING STUDENT\n\n<img class=\"ui medium left floated image\" src=\"/images/help/student-configuration-select-student-update-existing.png\">\n\nIn the \"Select Student\" pane, click on \"Update Existing\" and then click the student you wish to update.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n<img class=\"ui medium left floated image\" src=\"/images/help/student-configuration-update-student.png\">\n\nAfter selecting the student, this pane appears which allows you to edit their student information. \n\n<div class=\"ui hidden clearing divider\"></div>\n\n#### VIEW AND EDIT ADVISOR LOG\n\n<img class=\"ui medium left floated image\" src=\"/images/help/advisor-advisor-log.png\">\n\nUse this pane to add advisor comments for the selected student. You can also view past advisor comments. If there are multiple advisors, you can view all past comments from all advisors.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n#### UPLOAD STAR DATA\n\n<img class=\"ui medium left floated image\" src=\"/images/help/advisor-upload-star-data.png\">\n\nClick on the \"Choose File\" button to choose a STAR data file from your local directory. This file **must** be in a *.csv* format, and can be downloaded from [STAR](https://www.star.hawaii.edu). \n\nClick on the \"LOAD STAR DATA\" button to upload the data for the selected student. The \"STAR Data Upload Log\" below the button lists a history of past STAR data uploads. You can click the link at the very bottom of the \"UPDATE STUDENT & DEGREE PLAN\" pane to view changes in the student's degree plan after uploading the STAR data.\n\n<div class=\"ui hidden clearing divider\"></div>",
          "retired": false
        },
        {
          "routeName": "/advisor/:username/verification-requests",
          "title": "Learn About Verification Requests",
          "text": "Student participation in RadGrad opportunities consists of the following procedure:\n\n1. The student selects an opportunity, and adds it to their degree plan for a specific academic term. \n2. The student participates (or fails to participate) in the opportunity.\n3. The student requests verification that they participated in that opportunity.\n3. This verification request is accepted or declined by the sponsoring faculty member, advisor, or RadGrad admin.  Only after the verification request is accepted does the student earn the ICE points associated with that opportunity.\n\nThis page allows you to view all the pending verification requests and then accept or reject these requests.\n\n<b>PENDING VERIFICATIONS</b>\n\n<img class=\"ui medium left floated image\" src=\"/images/help/advisor-verification-requests-pending.png\">\nThis widget lists all pending verification requests. Verification requests are submitted by students when they would like RadGrad to acknowledge that they have successfully completed a particular opportunity. \n\nIf you believe that the student has successfully completed this opportunity, you can accept a request by clicking the green \"ACCEPT\" button. If you believe that the student has NOT successfully completed this opportunity, you can decline a request by clicking the red \"DECLINE\" button. You may also provide any feedback for your response. The student will be able to see your response on their RadGrad site.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n<b>EVENT VERIFICATIONS</b>\n\n<img class=\"ui medium left floated image\" src=\"/images/help/advisor-verification-requests-event.png\">\nThis widget allows you to verify a student for successful completion of a particular opportunity (event). This is the same as accepting a verification request on the \"VERIFICATION REQUESTS\" widget.\n\nIf you believe that the student has successfully completed this opportunity, you can verify the student by selecting the event, inputting the student's UH username, and clicking on the \"VERIFY ATTENDANCE\" button.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n<b>COMPLETED VERIFICATIONS</b>\n\n<img class=\"ui medium left floated image\" src=\"/images/help/advisor-verification-requests-completed.png\">\nThis page lists all completed verification requests. Verification requests are submitted by students when they would like RadGrad to acknowledge that they have successfully completed a particular opportunity. These verification requests are either accepted or declined by an advisor. \n\nYou may reopen a verification request by clicking on the green \"REOPEN\" button. By doing this, the verification request will disappear from the \"COMPLETED VERIFICATIONS\" page, and will reappear on the \"VERIFICATION REQUESTS\" page. Then, you may go through the process of providing feedback and either accepting or declining the verification request again.\n\n<div class=\"ui hidden clearing divider\"></div>",
          "retired": false
        },
        {
          "routeName": "/advisor/:username/academic-plan",
          "title": "Learn About Academic Plan Construction",
          "text": "This page allows you to manage Academic Plans. It has two tabs: Viewer and Builder.\n\n* The Viewer tab allows you to view created *Academic Plans*. Choose the year then the Academic Plan name.\n* The \"Builder\" tab allows you to create new *Academic Plans*. Choose the degree you are building an Academic Plan for and enter the name of the Academic Plan, then select the year that the Academic Plan will be effective for. The bottom left side of the tab has the years of the plan. The bottom right side has the different \"Course Choices\". \n     * To create a plan drag a choice to its year and academic term. You can rearrange the choice by dragging them. To delete a choice drag it to the trash area. Once the plan is complete press the \"Save Academic Plan\" button.\n     * Below the Course Choices is the link (chain) icon where you can create an *OR* choice. For example, if you want to create the choice *ICS 312 or ICS 331*, drag the ICS 312 button into the link area and then drag the ICS 331 button. This will create a *ICS 312 or ICS 331* button. If you want to save the choice, drag it back into the Course Choices area.",
          "retired": false
        },
        {
          "routeName": "/advisor/:username/moderation",
          "title": "Learn About Moderation",
          "text": "On RadGrad, students can provide public feedback with course reviews, opportunity reviews, and Mentor Space questions. To maintain a high-integrity learning environment, all of these public feedbacks require moderation. \n\n**Course and Opportunity Reviews:**\nCourse reviews and Opportunity reviews will be visible to the public unless they are rejected through moderation. \n\n**Mentor Space Questions:**\nMentor Space questions remain hidden from the public until they are accepted through moderation, to avoid mentors answering questions that will get deleted in the future. All Mentor Space questions are required to have a *slug*, and you will be required to provide one if it is the first time the question is going through moderation. If the question has already been assigned a slug, you cannot change it. \n\nA slug is a unique string to identify a Mentor Space question. An example of a slug is \"question-abi-0\". This indicates that the question is from abi@hawaii.edu and this is their first question in the Mentor Space.\n\n\nIf the review or question is acceptable by RadGrad standards, you can accept it by clicking on the green \"ACCEPT\" button. If the review or question is unacceptable in any way by RadGrad standards, you can decline it by clicking on the red \"DECLINE\" button. You may also provide any feedback for your response. The student will be able to see your response on their RadGrad site. A student may decide to either discard their review or question or edit it and resubmit it for further moderation. There is currently no limit to the amount of edits that a student may make.",
          "retired": false
        },
        {
          "routeName": "/advisor/:username/scoreboard",
          "title": "Learn about Scoreboards",
          "text": "This page allows you to see the different scoreboards. The scoreboards show how many students are participating in an entity (currently Courses and Opportunities) for a corresponding academic term.",
          "retired": false
        },
        {
          "routeName": "/advisor/:username/scoreboard/course-scoreboard",
          "title": "When do students want to take which course?",
          "text": "The Course Scoreboard allows you to see which courses students are planning to take for the next three years and the amount of those students in each course.",
          "retired": false
        },
        {
          "routeName": "/advisor/:username/scoreboard/opportunity-scoreboard",
          "title": "When do students want to take which opportunity?",
          "text": "The Opportunity Scoreboard allows you to see which opportunities students are planning to do for the next three years and the amount of those students in each opportunity.",
          "retired": false
        },
        {
          "routeName": "/explorer/plans",
          "title": "So. You want to explore?",
          "text": "The Explorer provides detailed information about Academic Plans, Career Goals, Courses, Degrees, Interests, and Opportunities.\n\nJust click the dropdown menu to the left of the page to select the type of information you wish to explore.",
          "retired": false
        },
        {
          "routeName": "/explorer/career-goals",
          "title": "So. You want to explore?",
          "text": "The Explorer provides detailed information about Academic Plans, Career Goals, Courses, Degrees, Interests, and Opportunities.\n\nJust click the dropdown menu to the left of the page to select the type of information you wish to explore.",
          "retired": false
        },
        {
          "routeName": "/explorer/courses",
          "title": "So. You want to explore?",
          "text": "The Explorer provides detailed information about Academic Plans, Career Goals, Courses, Degrees, Interests, and Opportunities.\n\nJust click the dropdown menu to the left of the page to select the type of information you wish to explore.",
          "retired": false
        },
        {
          "routeName": "/explorer/degrees",
          "title": "So. You want to explore?",
          "text": "The Explorer provides detailed information about Academic Plans, Career Goals, Courses, Degrees, Interests, and Opportunities.\n\nJust click the dropdown menu to the left of the page to select the type of information you wish to explore.",
          "retired": false
        },
        {
          "routeName": "/explorer/interests",
          "title": "So. You want to explore?",
          "text": "The Explorer provides detailed information about Academic Plans, Career Goals, Courses, Degrees, Interests, and Opportunities.\n\nJust click the dropdown menu to the left of the page to select the type of information you wish to explore.",
          "retired": false
        },
        {
          "routeName": "/explorer/opportunities",
          "title": "So. You want to explore?",
          "text": "The Explorer provides detailed information about Academic Plans, Career Goals, Courses, Degrees, Interests, and Opportunities.\n\nJust click the dropdown menu to the left of the page to select the type of information you wish to explore.",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/explorer",
          "title": "Learn about the Explorer",
          "text": "The Explorer provides detailed information about Academic Plans, Career Goals, Courses, Degrees, Interests, and Opportunities.\n\nJust click the dropdown menu to the left of the page to select the type of information you wish to explore.",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/verification-requests",
          "title": "Learn About Verification",
          "text": "Student participation in RadGrad opportunities consists of the following procedure:\n\n1. The student selects an opportunity, and adds it to their degree plan for a specific academic term. \n2. The student participates (or fails to participate) in the opportunity.\n3. The student requests verification that they participated in that opportunity.\n3. This verification request is accepted or declined by the sponsoring faculty member, advisor, or RadGrad admin.  Only after the verification request is accepted does the student earn the ICE points associated with that opportunity.\n\nThis page allows you to view all the pending verification requests and then accept or reject these requests.\n\n<b>PENDING VERIFICATIONS</b>\n\n<img class=\"ui medium left floated image\" src=\"/images/help/advisor-verification-requests-pending.png\">\nThis widget lists all pending verification requests. Verification requests are submitted by students when they would like RadGrad to acknowledge that they have successfully completed a particular opportunity. \n\nIf you believe that the student has successfully completed this opportunity, you can accept a request by clicking the green \"ACCEPT\" button. If you believe that the student has NOT successfully completed this opportunity, you can decline a request by clicking the red \"DECLINE\" button. You may also provide any feedback for your response. The student will be able to see your response on their RadGrad site.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n<b>EVENT VERIFICATIONS</b>\n\n<img class=\"ui medium left floated image\" src=\"/images/help/advisor-verification-requests-event.png\">\nThis widget allows you to verify a student for successful completion of a particular opportunity (event). This is the same as accepting a verification request on the \"VERIFICATION REQUESTS\" widget.\n\nIf you believe that the student has successfully completed this opportunity, you can verify the student by selecting the event, inputting the student's UH username, and clicking on the \"VERIFY ATTENDANCE\" button.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n<b>COMPLETED VERIFICATIONS</b>\n\n<img class=\"ui medium left floated image\" src=\"/images/help/advisor-verification-requests-completed.png\">\nThis page lists all completed verification requests. Verification requests are submitted by students when they would like RadGrad to acknowledge that they have successfully completed a particular opportunity. These verification requests are either accepted or declined by an advisor. \n\nYou may reopen a verification request by clicking on the green \"REOPEN\" button. By doing this, the verification request will disappear from the \"COMPLETED VERIFICATIONS\" page, and will reappear on the \"VERIFICATION REQUESTS\" page. Then, you may go through the process of providing feedback and either accepting or declining the verification request again.\n\n<div class=\"ui hidden clearing divider\"></div>",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/home",
          "title": "About the faculty profile page",
          "text": "For RadGrad to effectively \"match\" students with faculty, it is helpful for you to provide useful profile information.\n\n**Name** and **Email** - These two fields are read-only. Contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)) to change them.\n\n**Interests** and **Career Goals** - Please edit these to reflect the interests and career goals that you would like to \"match\" with students, and thus open an opportunity to play an advisory role. For most faculty, the career goals \"Graduate School\" and \"Research Scientist\" are appropriate. You might also wish to advise students on other career goals.\n\n**Website** - Please provide a link to your personal home page or research lab site.\n\n**Picture** - A headshot is useful for helping students recognize you.  Note these images are generally shown quite small.",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/manage-opportunities",
          "title": "How to create and manage opportunities",
          "text": "In RadGrad, opportunities are activities outside of regular coursework that enable students to earn \"Innovation\" and \"Experience\" points. When students pick an opportunity, they associate it with a specific academic term (Fall, Spring, or Summer).  \n\nFor faculty, the most important reason to create opportunities is because it provides a mechanism for you to advertise your research projects to students.  Advertising your research projects as opportunities has the following advantages to you:\n\n1. By specifying one or more \"interests\" (i.e. disciplinary areas) associated with your research project, RadGrad can recommend your project to students who have also specified those interest areas.   \n\n2.  Because students earn ICE points for completing opportunities, and because we recommend you award the maximum number of Innovation points for participating in a research project for each academic term, students who wish to achieve the higher levels in RadGrad will almost certainly need to participate in a faculty research project.\n\n3. Students can pick your research project for multiple academic terms and earn Innovation points for each academic term.\n\n4. If you want to, you can offer the student the ability to enroll in an independent study course with you in addition to this opportunity.  That gives the student the ability to earn both Innovation and Competency points for the same work.\n\nTaken together, these advantages increase the odds that you will connect with qualified, motivated students when you specify one or more of your research projects as opportunities.\n\nStudents do not automatically earn points just for adding one of your opportunities to their degree plan. In order to get the points, they must ask you to \"verify\" their participation.  If you do not feel they participated enough to warrant the points at the end of an academic term, you do not have to verify their participation.\n\nUnless your project entails regular contact and interaction with industry professionals, your opportunity should not provide any Experience points. \n\nYou can review the existing opportunities listed below to see how points are currently awarded so that you can define your opportunity consistently.",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/explorer/career-goals",
          "title": "About career goals",
          "text": "The list of Career Goals is managed by RadGrad administrators, and is intended to cover the future careers most appropriate for our student population. \n\nAs a faculty member, it is useful for you to select one or more career goals for which you have some direct experience or expertise (such as \"Graduate School\" or \"Research Scientist\"), as that will indicate to students that you can be contacted for advice concerning that career goal.\n\nIf you have suggestions for how to improve the set of Career Goals, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)).",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/explorer/courses",
          "title": "About courses",
          "text": "This page is intended to list all courses available in our degree program.\n\nIf you notice that a course is missing, or its description is no longer accurate, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)) and request an update.",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/explorer/plans",
          "title": "About academic plans",
          "text": "RadGrad distinguishes between \"degree programs\" and \"academic plans\":\n\n* A \"degree program\" is a course of study toward a specific degree (and, optionally, specialization). For example, \"B.A. in Computer Science\" or \"B.S. in Computer Sciences/Security Sciences\" are degree programs.\n\n* An \"academic plan\" is the set of departmental course requirements that must be fulfilled in order to complete a degree program.  Departments can change the requirements once a year, and so academic plans have a year associated with them that indicates the year that they became the default requirements for their associated degree program.\n\nOnce students declare our major, they can choose the current academic plan associated with a degree program, or any future update to the academic plan.  For example, say a student wants to get a B.S. in Computer Science, and they declare our major in 2016.  Then, they can choose the B.S. in Computer Science academic plan from 2015 (since that was the one currently in effect when they declared their major).  They can also choose any future updated version of the academic plan, such as the B.S. in Computer Science from 2017.\n\nThis page lists all of the currently defined academic plans.  If you discover that an academic plan is missing or that it does not accurately represent the degree requirements, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)).",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/explorer/interests",
          "title": "About interests",
          "text": "Interests represent disciplinary areas. \n\nAs a faculty member, you will want to choose a set of Interests so that you \"match\" with students interested in the same disciplinary areas. This increases your chances of finding good students to work with, and increases the chances that students will come to you for advice regarding this disciplinary area.\n\nIf you would like to request new interests or edits to any existing interest, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)).",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/explorer/opportunities",
          "title": "About opportunities",
          "text": "In RadGrad, opportunities are activities outside of regular coursework that enable students to earn \"Innovation\" and \"Experience\" points. When students pick an opportunity, they associate it with a specific academic term (Fall, Spring, or Summer).\n\nFor faculty, opportunities provide a mechanism for you to advertise your research projects to students. Advertising your research projects as opportunities has the following advantages to you:\n\n1. By associating one or more \"interests\" (i.e. disciplinary areas) with your research project, RadGrad can recommend your project to students who have also specified those interest areas.\n\n2. Because students gain ICE points for completing opportunities, and because we recommend you award the maximum number of Innovation points for participating in a research project for each academic term, students who wish to achieve the higher levels in RadGrad will almost certainly need to participate in a faculty research project.\n\n3. Students can pick your research project for multiple academic terms and gain opportunity points for each academic term.\n\n4. If you want, you can offer the student the ability to enroll in an independent study course with you in addition to this opportunity. That gives the student the ability to \"double dip\", and gain both Innovation and Competency points for the same work.\n\nTo create new opportunities or to manage opportunities you have created, click on the \"Manage Opportunities\" link in the navigation bar.",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/explorer/users",
          "title": "About users",
          "text": "This page provides a browser for the users currently registered with RadGrad.\n\nRadGrad is not an open system.  In order for someone to login to RadGrad, they must have been explicitly registered by a RadGrad advisor or admin.\n\nIf there is someone who you believe should have a RadGrad account, or if you believe there is a RadGrad user who should no longer have access to the system, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)).",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/scoreboard",
          "title": "Learn about Scoreboards",
          "text": "This page allows you to see the different scoreboards. The scoreboards show how many students are participating in an entity (currently Courses and Opportunities) for a corresponding academic term.",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/scoreboard/course-scoreboard",
          "title": "When do students want to take which course?",
          "text": "The Course Scoreboard allows you to see which courses students are planning to take for the next three years and the amount of those students in each course.\n\nThis allows the faculty to gauge which courses are high in demand and therefore allow the faculty to make decisions which courses should be allocated more attention and resources.",
          "retired": false
        },
        {
          "routeName": "/faculty/:username/scoreboard/opportunity-scoreboard",
          "title": "When do students want to take which opportunity?",
          "text": "The Opportunity Scoreboard allows you to see which opportunities students are planning to do for the next three years and the amount of those students in each opportunity.\n\nThis allows the faculty to gauge which opportunities are highly attractive to students and what type of opportunities would students most likely engage in.",
          "retired": false
        },
        {
          "routeName": "/mentor/:username/home",
          "title": "Why do mentors need profiles?",
          "text": "Thank you for volunteering to be a RadGrad mentor! \n\nThere are really two aspects to RadGrad mentorship:\n\n1. Answering questions from students about life after graduation in the Mentor Space page.\n\n2. Being available as a resource for students interested in specific disciplinary areas (\"interests\") or professional paths (\"career goals\").   \n\nBy filling out your profile, you make it easy for students to find you when they are exploring matching opportunities, interests, and career goals.",
          "retired": false
        },
        {
          "routeName": "/mentor/:username/explorer/career-goals",
          "title": "About career goals",
          "text": "The list of Career Goals is managed by RadGrad administrators, and is intended to cover the future careers most appropriate for our student population.\n\nAs a mentor, it is useful for you to select one or more career goals for which you have some direct experience or expertise, as that will indicate to students that you can be contacted for advice concerning that career goal.\n\nIf you have suggestions for how to improve the set of Career Goals, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)).",
          "retired": false
        },
        {
          "routeName": "/mentor/:username/explorer/courses",
          "title": "About courses",
          "text": "This page is intended to list all courses available in our degree program.\n\nIf you notice that a course is missing, or its description is no longer accurate, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)) and request an update.",
          "retired": false
        },
        {
          "routeName": "/mentor/:username/explorer/plans",
          "title": "About academic plans",
          "text": "RadGrad distinguishes between \"degree programs\" and \"academic plans\":\n\n*  A \"degree program\" is a course of study toward a specific degree (and, optionally, specialization). For example, \"B.A. in Computer Science\" or \"B.S. in Computer Sciences/Security Sciences\" are degree programs.\n\n* An \"academic plan\" is the set of departmental course requirements that must be fulfilled in order to complete a degree program. Departments can change the requirements once a year, and so academic plans have a year associated with them that indicates the year that they became the default requirements for their associated degree program.\n\nOnce students declare our major, they can choose the current academic plan associated with a degree program, or any future update to the academic plan. For example, say a student wants to get a B.S. in Computer Science, and they declare our major in 2016. Then, they can choose the B.S. in Computer Science academic plan from 2015 (since that was the one currently in effect when they declared their major). They can also choose any future updated version of the academic plan, such as the B.S. in Computer Science from 2017.\n\nThis page lists all of the currently defined academic plans. If you discover that an academic plan is missing or that it does not accurately represent the degree requirements, please contact a RadGrad administrator.",
          "retired": false
        },
        {
          "routeName": "/mentor/:username/explorer/interests",
          "title": "About interests",
          "text": "Interests represent disciplinary areas.\n\nAs a mentor, you will want to choose a set of Interests so that you \"match\" with students interested in the same disciplinary areas. This increases the ability of students to connect with you around shared interests.\n\nIf you would like to request new interests or edits to any existing interest, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)).",
          "retired": false
        },
        {
          "routeName": "/mentor/:username/explorer/opportunities",
          "title": "About opportunities",
          "text": "In RadGrad, opportunities are activities outside of regular coursework that enable students to earn \"Innovation\" and \"Experience\" points. When students pick an opportunity, they associate it with a specific academic term.\n\nFor mentors, opportunities provide a mechanism for you to advertise internships in your company to students for Fall, Spring, or Summer. Advertising your internships as opportunities has the following advantages to you:\n\n1. By specifying one or more \"interests\" (i.e. disciplinary areas) associated with your internship opportunity, RadGrad can recommend your project to students who have also specified those interest areas.\n\n2. Because students gain ICE points for completing opportunities, and because we recommend you award the maximum number of Experience points (25) for participating in a full-time summer internship, students who wish to achieve the higher levels in RadGrad will almost certainly need to participate in an internship for at least one academic term.\n\n3. Students can pick your internship for multiple academic terms and gain opportunity points for each academic term.\n\n4. Finally, you might be able to arrange for the student to enroll in an independent study course with a faculty member in addition to this opportunity. That gives the student the ability to \"double dip\", and gain both Innovation and Experience points for the same work.\n\nThis page shows currently defined opportunities, but does not allow you to define a new one.  If you wish to define a new RadGrad opportunity (typically for an internship at your company), then contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)) for assistance.",
          "retired": false
        },
        {
          "routeName": "/mentor/:username/explorer/users",
          "title": "About users",
          "text": "This page provides a browser for the users currently registered with RadGrad.\n\nRadGrad is not an open system. In order for someone to login to RadGrad, they must have been explicitly registered by a RadGrad advisor or admin.\n\nIf there is someone who you believe should have a RadGrad account, or if you believe there is a RadGrad user who should no longer have access to the system, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)).",
          "retired": false
        },
        {
          "routeName": "/mentor/:username/explorer",
          "title": "Learn about the Explorer",
          "text": "The Explorer provides detailed information about Career Goals, Courses, Academic Plans, Interests, Opportunities, and Users.\n\nJust click the dropdown menu to the left to select the type of information you wish to explore.",
          "retired": false
        },
        {
          "routeName": "/mentor/:username/mentor-space",
          "title": "How does Mentor Space work?",
          "text": "Mentor Space enables students to connect with you, the RadGrad mentors: ICS alumni and other high tech professionals who are volunteering their time to help get the latest information about careers and job opportunities in Hawaii and beyond.\n\nThere are two basic ways students interact with you. \n\n1. The best way is for students to propose a new question using the \"Ask a new question\" form. This question will be reviewed by RadGrad administrators, potentially edited for clarity, and then released for all the mentors to answer. We believe this approach is the best way to interact with mentors because students can get a variety of perspectives from different fields and different geographic areas, and because your answers are available to all current and future RadGrad students. \n\n2. A second way is for a student to contact you directly with questions.  This can work if their questions are not of general interest or are not \"archival\" in nature (i.e. \"Are there any job openings at your company right now?\").  We don't strongly encourage this form of interaction, but it's certainly possible via RadGrad since you are providing your email and LinkedIn contact details. \n\nIf you encounter any inappropriate interactions with any students, please contact a RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)) immediately so we can address the problem with the student.",
          "retired": false
        },
        {
          "routeName": "/student/:username/home",
          "title": "Make the most of your home page",
          "text": "This page presents RadGrad's recommendations for courses and opportunities based on your interests, as well as new events in the RadGrad community.\n\n#### RECOMMENDED OPPORTUNITIES\n\n<img class=\"ui medium left floated image\" src=\"/images/help/home-recommended-opportunities.png\">\n\nThis pane shows recommended opportunities based upon your interests and career goals.  Click \"View More\" to go to a page with details, \"Add to plan\" to add it to your Degree Plan, and \"Hide\" if you're not interested in this content and don't want to see it in this pane.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n#### RECOMMENDED COURSES\n\n<img class=\"ui medium left floated image\" src=\"/images/help/home-recommended-courses.png\">\n\nThis pane shows recommended courses based upon your interests and career goals.  Click \"View More\" to go to a page with details, \"Add to plan\" to add it to your Degree Plan, and \"Hide\" if you're not interested in this content and don't want to see it in this pane.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n#### RECENT COMMUNITY ACTIVITY\n\n<img class=\"ui medium left floated image\" src=\"/images/help/home-community-activity.png\">\n\nThe \"Recent Community Activity\" pane lets you know when a new student joins RadGrad, or when a new course, opportunity, or review becomes available. You can click on the link to learn more about the update.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n#### TEASERS\n\n<img class=\"ui medium left floated image\" src=\"/images/help/home-teasers.png\">\n\nFinally, the \"Teaser\" pane provides very short videos by ICS community members that match your interests or career goals. When you have a spare moment, take a look at a video or two!\n\n<div class=\"ui hidden clearing divider\"></div>",
          "retired": false
        },
        {
          "routeName": "/student/:username/degree-planner",
          "title": "Make the Degree Planner work for you!",
          "text": "The Degree Planner helps you organize your ICS Degree experience on an academic term-by-term basis. You can plan the courses you need to satisfy your chosen degree plan as well as the the extracurricular opportunities that provide you with real world experiences and chances to innovate outside the classroom. \n\nIn terms of ICE, courses earn you Competency points, while opportunities earn you Innovation and Experience points. All three are critical to becoming a well-rounded graduate who is most attractive to employers and graduate schools!\n\n#### DEGREE PLAN\n\n<img class=\"ui medium left floated image\" src=\"/images/help/degree-planner-plan.png\">\n\nThe \"Degree Plan\" pane shows you your courses and opportunities on an academic term-by-term basis.\n\nFor past academic terms, courses and opportunities are listed in light grey and are read-only.  To modify the contents of your degree plan for previous academic terms, please see an ICS advisor. You will generally want to ask them to update your historical data from your STAR data after each academic term.\n\nFor current and future academic terms, you can freely add and delete courses and opportunities according to your preferences. For future courses, you can even indicate the grade you plan to achieve in the course, which enables RadGrad to estimate your final Competency points. \n\nClicking on a course or opportunity will display details about it in the \"Inspector\" pane.\n\n<div class=\"ui hidden clearing divider\"></div>\n\n#### INSPECTOR\n\n<img class=\"ui medium left floated image\" src=\"/images/help/inspector-course.png\">\n\nThe \"Inspector\" pane provides dropdown menus  that allow you to view details about any course or opportunity in the system.  This includes the ICE points you can earn for that course or opportunity.\n\nThe Inspector also allows you to add a course or opportunity to your degree plan by \"dragging\" the associated button naming the course or opportunity to any current or future academic term. \n\nClick on any course or opportunity in your degree plan to bring up details about them in the \"Inspector\".\n\n<div class=\"ui hidden clearing divider\"></div>\n\n<img class=\"ui medium left floated image\" src=\"/images/help/inspector-opportunity.png\">\n\nFor opportunities, you can also request verification through the Inspector pane. Clicking the button will send a message to an advisor who will check your verification evidence.  When verified, the associated ICE points will be awarded to you.\n\n<div class=\"ui clearing hidden divider\"></div>\n\n#### ACADEMIC PLAN\n\n<img class=\"ui medium left floated image\" src=\"/images/help/degree-planner-academic-plan.png\">\n\nThe \"Academic Plan\" pane provides you with the requirements for graduating with any of the degree programs. Since the department evolves the requirements for Academic Plans on occasion, you must select both an academic plan (such as B.S. in Computer Sciences) as well as the year that the specified requirements were enacted (say, 2016). You are eligible to select any degree plan available during the year you declare yourself as an ICS major, and you can switch to any future degree plan if you prefer. \n\nOnce you have selected an Academic Plan, RadGrad will indicate which requirements you have and have not satisfied in your degree plan&mdash;requirements you have satisfied are listed in green, and those you have not are listed in red.\n\nIn the sample Academic Plan image, you can see that the student has satisfied all the requirements except for one 400-level course because it is presented in red.\n\n<div class=\"ui clearing hidden divider\"></div>\n\n#### RECOMMENDATIONS & WARNINGS\n\n<img class=\"ui medium left floated image\" src=\"/images/help/degree-planner-recommendations-warnings.png\">\n\nRadGrad can offer personalized recommendations for courses and opportunities based upon your desired degree, your interests, and your career goals. \n\nIt will also flag problems with your degree plan, such as adding a course without the appropriate prerequisite.\n\n<div class=\"ui hidden clearing divider\"></div>",
          "retired": false
        },
        {
          "routeName": "/student/:username/home/aboutme",
          "title": "How to use the About Me Page",
          "text": "The About Me page provides your RadGrad profile and enables you to manage certain details. This information enables RadGrad to help you connect with others with similar interests and career goals, and enables the system to make better recommendations for you.\n\n**Name** and **Email**: Your name and email cannot be changed unless you visit an ICS advisor or admin. \n\n**Picture**: Help us recognize you IRL (in real life!) Don't worry, your image is not displayed outside of RadGrad. Click the \"Upload\" button to upload a picture and crop it to a square image.  Note that after you upload your image, you need to press the \"Update\" button so that the system will save it.  \n\n**Website**: Help others learn more about you by providing a link to your professional website. If you don't have one already, you will create one as part of ICS 314.\n\n**Career Goals**: Specify at least one career goal, so that RadGrad can recommend courses and opportunities. You can change this at any time. \n\n**Interests**:  Specifying interests also helps RadGrad to recommend courses and opportunities for you. Of course, your interests will change as you progress through the degree program.",
          "retired": false
        },
        {
          "routeName": "/student/:username/home/ice",
          "title": "What's the deal with ICE?",
          "text": "Many students think that the only important measure of academic success is their GPA. Sadly, whether you're hoping to go to graduate school or just get an interesting, high paying job after graduation, a good GPA is no longer enough for you to stand out from the crowd.\n\nIn today's competitive market, employers and graduate schools are looking for evidence that you are *competent* with essential skills, that you can create *innovative* solutions to problems, and that you have some *experience* with the professional world outside of the university setting.\n\nRadGrad provides ICE as a way for you to measure your progress toward a truly well-rounded education that goes beyond the GPA. For each course and opportunity you participate in, you gain a certain number of ICE points.  Your goal, should you decide to accept it, is to achieve 100 points in all three categories by the time you graduate. \n\nSo just exactly how do you obtain these points?\n\n**INNOVATION**: You earn innovation points by completing opportunities that involve \"innovation\", such as research projects, hackathons, or other activities producing new insights or technologies. \n\n**COMPETENCY**: You earn competency points by completing classes.  The number of competency points depends upon your grade: you get 10 points for any kind of A, 6 points for any kind of B, and no points for a C or below. \n\n**EXPERIENCE**: You earn experience points by completing opportunities that provide \"real world experience\", such as internships or business plan competitions.\n\n#### The ICE Circle, explained\n\n<img style=\"padding-left: 10px\" class=\"ui small left floated image\" src=\"/images/help/ice-circle.png\">\n\nYour current ICE status is displayed graphically with a circle that appears in your navigation bar at the top of each RadGrad page, and also in annotated form on this page.   The circle indicates several things:\n\nFirst, your current number of *verified* points for this ICE measure. This appears as a number in the center of the circle.  It is also represented by the darkly colored portion of the circle. In this example, the student has 5 verified Innovation points, which appears as a number in the center of the circle and with 5% of the circle colored with a dark green line.\n\nSecond, your current number of *unverified* points for this ICE measure.  This appears as the lightly colored portion of the circle. In this example, the student has 90 unverified innovation points, which typically indicates the points she will receive for opportunities she has planned to participate at some future date in her degree program. So, 90% of the circle is colored with a light green line.\n\nThird, whether or not you have planned enough courses or opportunities to achieve 100 points for this ICE measure.  If any portion of the circle is light grey, that indicates that you have not yet planned enough courses or opportunities. In this example, the student has only added enough opportunities to her degree plan to achieve 95 Innovation points. So, 5% of the circle is colored with a light grey line.\n\n#### VERIFICATION\n\nThe RadGrad ICE score would not be meaningful if the points do not accurately represent the actual degree program experience. Therefore, all ICE points must be verified in order to count.  Otherwise, someone could get competency points for courses they didn't take, or experience points for internships they didn't actually do.\n\nTo verify your coursework, visit an ICS advisor after each academic term to ask them to upload your current STAR data to RadGrad.  You will receive verified competency points for each course in your STAR data that appears in RadGrad. \n\nOpportunities are verified in many different ways. Each opportunity description lists the mechanism for verification. For example, for some opportunities it may be as simple as taking a selfie with the organizer and then showing that picture to an ICS advisor or faculty member.",
          "retired": false
        },
        {
          "routeName": "/student/:username/home/levels",
          "title": "Want to level up?",
          "text": "As you progress through your degree program, RadGrad recognizes your development through six levels, represented by the colors grey, yellow, green, blue, brown, and black. The exact requirements to achieve certain levels are shrouded in mystery, but here are some hints:\n\n<div class=\"ui cards\">\n<div class=\"ui card\">\n    <div class=\"content\">\n        <img class=\"right floated mini ui image\" src=\"/images/level-icons/radgrad-level-1-icon.png\">\n        <div class=\"header\"> LEVEL 1</div>\n        <div class=\"meta\">GRAY</div>\n        <div class=\"description\">\n          You begin your RadGrad experience at Level 1, and you will receive this laptop sticker when you first sign up for RadGrad with your advisor. <em>\"A journey of a thousand miles begins with a single step\" -- Lao Tzu</em>\n        </div>\n    </div>\n</div>\n\n<div class=\"ui card\">\n    <div class=\"content\">\n        <img class=\"right floated mini ui image\" src=\"/images/level-icons/radgrad-level-2-icon.png\">\n        <div class=\"header\"> LEVEL 2 </div>\n        <div class=\"meta\">YELLOW</div>\n        <div class=\"description\">\n          Successfully finish your first academic term of ICS coursework. Then meet with your advisor and ask him/her to update RadGrad with your current STAR data. That should bring you to Level 2, and earn you the Level 2 laptop sticker.\n        </div>\n    </div>\n</div>\n\n<div class=\"ui card\">\n    <div class=\"content\">\n        <img class=\"right floated mini ui image\" src=\"/images/level-icons/radgrad-level-3-icon.png\">\n        <div class=\"header\"> LEVEL 3 </div>\n        <div class=\"meta\">GREEN</div>\n        <div class=\"description\">\n          With any luck, you'll achieve Level 3 after you complete your second academic term of ICS coursework, as long as your grades are good. As before, meet with your Advisor to update RadGrad with your current STAR data, and if the system shows you've gotten to Level 3, you'll get your Green laptop sticker.\n        </div>\n    </div>\n</div>\n\n<div class=\"ui card\">\n    <div class=\"content\">\n        <img class=\"right floated mini ui image\" src=\"/images/level-icons/radgrad-level-4-icon.png\">\n        <div class=\"header\"> LEVEL 4 </div>\n        <div class=\"meta\">BLUE</div>\n        <div class=\"description\">\n          ICS has a \"core curriculum\", and Level 4 students have not only finished it, but they have also thought beyond mere competency. Once your current STAR data is in RadGrad, and you've achieved some verified opportunities, you might just find yourself at Level 4! Meet with your advisor to pick up your sticker, and bask in the glory it will bring to you!\n        </div>\n    </div>\n</div>\n\n<div class=\"ui card\">\n    <div class=\"content\">\n        <img class=\"right floated mini ui image\" src=\"/images/level-icons/radgrad-level-5-icon.png\">\n        <div class=\"header\"> LEVEL 5 </div>\n        <div class=\"meta\">BROWN</div>\n        <div class=\"description\">\n          Level 5 students are far along in their degree program, and they've made significant progress toward 100 verified points in each of the three ICE categories.  You will probably be at least a Junior before Level 5 becomes a realistic option for you. Keep your STAR data current in RadGrad, make sure your opportunities are verified, and good luck! Some students might graduate before reaching Level 5, so try to be one of the few that make it all the way to here! \n        </div>\n    </div>\n</div>\n\n<div class=\"ui card\">\n    <div class=\"content\">\n        <img class=\"right floated mini ui image\" src=\"/images/level-icons/radgrad-level-6-icon.png\">\n        <div class=\"header\"> LEVEL 6</div>\n        <div class=\"meta\">BLACK</div>\n        <div class=\"description\">\n         If you achieve Level 6, you are truly one of the elite ICS students, and you will have demonstrated excellent preparation for entering the workforce, or going on to Graduate School, whichever you prefer.  Congratulations!  Note that in addition to fulfilling the ICE requirements, you'll also need to \"pay it forward\" to the RadGrad community in order to obtain your Black RadGrad laptop sticker. \n        </div>\n    </div>\n</div>\n</div>",
          "retired": false
        },
        {
          "routeName": "/student/:username/explorer",
          "title": "So. You want to explore?",
          "text": "The Explorer provides detailed information about Career Goals, Courses, Academic Plans, Interests, Opportunities, and Users.\n\nJust click the dropdown menu to the left to select the type of information you wish to explore.",
          "retired": false
        },
        {
          "routeName": "/student/:username/mentor-space",
          "title": "Learn about Mentor Space",
          "text": "Mentor Space enables you to connect with RadGrad mentors: ICS alumni and other high tech professionals who are volunteering their time to help get the latest information about careers and job opportunities in Hawaii and beyond.\n\nThere are two basic ways to interact with mentors. The best way is to propose a new question using the \"Ask a new question\" form. This question will be reviewed by RadGrad administrators, potentially edited for clarity, and then released for all the mentors to answer. This approach is the best way to interact with mentors because you can get a variety of perspectives from different fields and different geographic areas. \n\nA second way is to email a single mentor directly.  Please do this only if you have a very specific question of the mentor: perhaps you are interested in applying for a job at the mentor's company.  If you contact a mentor directly, please be sure to have your professional portfolio up to date and ready for them to review so that they can learn more about your background in order to provide a high quality answer.  You should also have reviewed the mentor's LinkedIn profile to learn more about them, and of course have reviewed all of the publicly available information about the company. Don't ask simple questions of a mentor that you could have easily found out through Google!",
          "retired": false
        },
        {
          "routeName": "/student/:username/home/log",
          "title": "Learn about the Advisor Meeting Log",
          "text": "Each time you meet with an ICS Advisor, they can summarize the results from your meeting as a RadGrad Advisor Log entry.\n\nYou can refer to this log to make sure you are following advisor recommendations. This also enables the advisor to follow up on issues raised in prior meetings.",
          "retired": false
        },
        {
          "routeName": "/student/:username/explorer/career-goals",
          "title": "About Career Goals",
          "text": "For RadGrad and its community to be as helpful to you as possible, you should specify at least a couple of potential career goals.\n\nBy specifying Career Goals, \n\n* The system can show you related courses and opportunities, helping you decide on an appropriate degree plan.\n\n* The system can show you students, faculty, alumni, and mentors with the same career goal, helping you to identify others who are interested in the same professional direction.\n\nOf course, it is likely that your career goals will change as you progress through your degree program.  It is also quite possible that new career goals will emerge during your degree program.  So, don't be afraid to review your career goals each academic term and modify them as your professional goals change. \n\nThe set of career goals are curated by the faculty to represent a good selection of the most promising career paths. Most career goals actually encompass several job titles. For example, the the \"Information Security Analyst\" career goal is intended to cover a wide variety of security-related job titles, including Security Analyst, Security Architect, Security Software Developer, Cryptanalyst, Security Engineer, Security Administrator, Cryptographer, and Security Consultant.\n\nIf there is a career goal you are interested in that is not listed here, please feel free to contact the RadGrad administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)) to suggest that it be added.",
          "retired": false
        },
        {
          "routeName": "/student/:username/explorer/courses",
          "title": "Why explore the courses?",
          "text": "The Courses Explorer enables you to make a deep dive into each of the courses associated with the degree program.\n\nIn addition to a brief description of the course, it provides additional useful information:\n\n* The Prerequisites pane shows which prerequisites you've already completed, which ones you have not completed but plan to complete, and which ones are not yet even listed in your degree plan.\n\n* The Course Reviews pane reveals what other RadGrad users have said about this course. Note that Course Reviews are not anonymous: you need to stand behind what you say!",
          "retired": false
        },
        {
          "routeName": "/student/:username/explorer/plans",
          "title": "What are Academic Plans, and why do I need one?",
          "text": "When you meet with your Advisor, you will normally discuss the pros and cons of various \"Degree Programs\", such as a \"B.S. in Computer Science\". \n\nWhat you don't normally discuss, at least at your first meeting, is the fact that there exist multiple versions of every Degree Program.  Every so often, the faculty meet and approve changes to a given Degree Program, dropping some requirements and adding others, in order for the Degree Program to stay modern and useful to students. \n\nThus, the specific requirements for any Degree Program are \"time stamped\": there is a B.S. in Computer Science approved in 2015 with one set of requirements, and another B.S. in Computer Science approved in 2017 with a slightly different set of requirements.\n\nIn RadGrad, we use \"Degree Program\" to refer to the general degree (i.e. B.S. in Computer Science), and \"Academic Plan\" to refer to a Degree Program with a specific set of requirements approved in a given academic year. (i.e. B.S. in Computer Science (2015)).\n\nThe set of Academic Plans available to you depend upon the academic term in which you declared yourself in this major.  All of the Academic Plans in effect at that point in time are available to you, as well as any Academic Plans the faculty create during the remainder of your time as a student. \n\nWhen you select an Academic Plan in this explorer, it shows the requirements over the course of eight academic terms, and displays in red any requirements that your current Degree Plan does not satisfy.",
          "retired": false
        },
        {
          "routeName": "/student/:username/explorer/interests",
          "title": "Making sense of interests",
          "text": "RadGrad provides \"interests\" as a way of specifying the various disciplinary areas of computer science (for example, artificial intelligence or software engineering), as well as disciplinary areas with strong overlap with computer science (for example, entrepreneurship or sustainability).\n\nBy specifying at least a few interests, you make RadGrad more useful:\n\n1. It can show you related courses and opportunities.\n\n2. You can find other students, faculty, alumni, and mentors with similar interests. \n\nOf course, your interests will change over time, so don't be afraid to change them as you learn more about the field.\n\nIf you have an interest that is not available in RadGrad, please email the administrator ([radgrad@hawaii.edu](mailto:radgrad@hawaii.edu)) to request that it be added.",
          "retired": false
        },
        {
          "routeName": "/student/:username/explorer/opportunities",
          "title": "Why care about opportunities?",
          "text": "A fundamental assumption of RadGrad is that you want to be a well-rounded graduate who is attractive to employers and/or graduate programs, and that an important way to achieve that is by developing your ability to innovate and to have professional experiences. \n\nRadGrad measures your progress toward \"well-roundedness\" through ICE: Innovation, Competency, and Experience. \n\nAnd the only way to gain Innovation and Experience is by taking advantage of Opportunities. \n\nThis page presents a curated list of Opportunities that the faculty believe will complement existing courses and increase your attractiveness to future employers and graduate programs.\n\nEach Opportunity has a set of interests associated with it. If the opportunity's interests match one or more of your own, they are colored in green, otherwise they are colored in grey.\n\nThe ICE Points associated with an Opportunity are listed as three colored circles at the top right corner of the description. In general, the middle circle (Competency) always has the value zero, since you earn Competency points from taking courses.",
          "retired": false
        },
        {
          "routeName": "/student/:username/explorer/users",
          "title": "Learn about the RadGrad Community",
          "text": "The User explorer enables you to learn about the RadGrad community.\n\nClick on any user to see a brief profile of them, which includes their Level (if they are student), professional profile (if they have one), courses and opportunities, and interests.",
          "retired": false
        }
      ]
    },
    {
      "name": "InterestCollection",
      "contents": [
        {
          "name": "Algorithms",
          "slug": "algorithms",
          "description": "Simply put, an algorithm is a self-contained step-by-step set of operations to be performed. More specifically, an algorithm is an effective method that can be expressed within a finite amount of space and time and in a well-defined formal language for calculating a function. Starting from an initial state and initial input (perhaps empty), the instructions describe a computation that, when executed, proceeds through a finite number of well-defined successive states, eventually producing \"output\" and terminating at a final ending state. The transition from one state to the next is not necessarily deterministic; some algorithms, known as randomized algorithms, incorporate random input. [Learn more here.](https://en.wikipedia.org/wiki/Algorithm)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Android",
          "slug": "android",
          "description": "Android is a mobile operating system (OS) currently developed by Google, based on the Linux kernel and designed primarily for touchscreen mobile devices such as smartphones and tablets. In addition to touchscreen devices, Google has further developed Android TV for televisions, Android Auto for cars, and Android Wear for wrist watches, each with a specialized user interface. Variants of Android are also used on notebooks, game consoles, digital cameras, and other electronics. Android has the largest installed base of all operating systems of any kind. Android has been the best selling OS on tablets since 2013, and on smartphones it is dominant by any metric. [Learn more here.](https://www.android.com/)",
          "interestType": "technologies"
        },
        {
          "name": "Angular",
          "slug": "angular",
          "description": "[AngularJS](https://angular.io/) is a JavaScript-based open-source front-end web application framework mainly maintained by Google and by a community of individuals and corporations to address many of the challenges encountered in developing single-page applications. Angular combines declarative templates, dependency injection, end to end tooling, and integrated best practices to solve development challenges.\n\nHere is a [short video introduction to Angular](https://www.youtube.com/watch?v=WAZTZUgeLhQ).",
          "interestType": "technologies"
        },
        {
          "name": "Apache Spark",
          "slug": "apache-spark",
          "description": "[Apache Spark](https://spark.apache.org/) is a fast, in-memory data processing engine with elegant and expressive development APIs to allow data workers to efficiently execute streaming, machine learning or SQL workloads that require fast iterative access to datasets.  Originally developed at the University of California, Berkeley's AMPLab, the Spark codebase was later donated to the Apache Software Foundation, which has maintained it since. \n\nSpark runs on Hadoop, Mesos, Kubernetes, standalone, or in the cloud. It can access diverse data sources including HDFS, Cassandra, HBase, and S3. You can run Spark using its standalone cluster mode, on EC2, on Hadoop YARN, on Apache Mesos, or on Kubernetes.\n\nHere is a [short introduction video](https://www.youtube.com/watch?v=TgiBvKcGL24) about Apache Spark.",
          "interestType": "technologies"
        },
        {
          "name": "Application Development",
          "slug": "application-development",
          "description": "Application development is the use of tools, technologies, procedures, and domain knowledge to create and maintain useful software and/or hardware systems.",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Artificial Intelligence",
          "slug": "artificial-intelligence",
          "description": "The use of hardware and software to create a flexible rational agent that perceives its environment and takes actions that maximize its chance of success at an arbitrary goal. Colloquially, the term \"artificial intelligence\" is likely to be applied when a machine uses cutting-edge techniques to competently perform or mimic functions that we intuitively associate with human minds, such as \"learning\" and \"problem solving\". [Learn more here.](https://en.wikipedia.org/wiki/Artificial_intelligence)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Assembler",
          "slug": "assembler",
          "description": "An assembler (or assembly) language is a low-level programming language for a computer in which there is a direct correspondence between the language and the architecture's machine code instructions. Each assembly language is specific to a particular computer architecture, in contrast to most high-level programming languages, which are generally portable across multiple architectures, but require interpreting or compiling. Assembly language may also be called symbolic machine code. Assembly language is converted into executable machine code by a utility program referred to as an assembler. The conversion process is referred to as assembly, or assembling the source code. [Learn more here.](https://en.wikipedia.org/wiki/Assembly_language)",
          "interestType": "technologies"
        },
        {
          "name": "Amazon Web Services",
          "slug": "aws",
          "description": "[Amazon Web Services (AWS)](https://aws.amazon.com/) is a secure cloud services platform, offering compute power, database storage, content delivery and other functionality to help businesses scale and grow.\n\nAWS is the biggest public cloud vendor — by a very wide margin. Synergy Research says that in 2017, AWS generated more revenue than the next five largest cloud vendors combined.\n\nHere is a [three minute video introduction to AWS](https://www.youtube.com/watch?v=mZ5H8sn_2ZI).",
          "interestType": "technologies"
        },
        {
          "name": "Azure",
          "slug": "azure",
          "description": "[Microsoft Azure](https://azure.microsoft.com/en-us/) is a cloud computing service that works similarly to Amazon Web Services (AWS) and the Google Cloud Platform. Azure allows you to host a variety of services in the cloud, including: web servers, email servers, databases, file storage servers, virtual machines, and user directories. See the [Azure Directory](https://azure.microsoft.com/en-us/services/) for a complete list of services. \n\nFrom a revenue and market share standpoint, Microsoft's cloud computing service made some huge gains in 2017, and it is particularly popular with enterprises that run Windows and other Microsoft software. According to third quarter 2017 data from [Synergy Research Group](https://www.srgresearch.com/articles/cloud-market-keeps-growing-over-40-amazon-still-increases-share), Microsoft is now the second biggest cloud vendor in the infrastructure as a service (IaaS), platform as a service (PaaS) and hosted private cloud market. Azure also had the fastest growth in the third quarter of any of the leading cloud vendors. According to Microsoft, 90% of Fortune 500 companies run some workloads on Microsoft's cloud.",
          "interestType": "technologies"
        },
        {
          "name": "Bioinformatics",
          "slug": "bioinformatics",
          "description": "Bioinformatics is an interdisciplinary field combining computer science, statistics, mathematics, and engineering that develops methods and software tools for understanding biological data. Common uses of bioinformatics include the identification of candidate genes and nucleotides (SNPs). Often, such identification is made with the aim of better understanding the genetic basis of disease, unique adaptations, desirable properties (esp. in agricultural species), or differences between populations. [Learn more here.](https://en.wikipedia.org/wiki/Bioinformatics)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Biology",
          "slug": "biology",
          "description": "A natural science concerned with the study of life and living organisms, including their structure, function, growth, evolution, distribution, and taxonomy. [Learn more here.](https://en.wikipedia.org/wiki/Biology)",
          "interestType": "non-cs-disciplines"
        },
        {
          "name": "Blockchain",
          "slug": "blockchain",
          "description": "A blockchain is a continuously growing list of records, called blocks, which are linked and secured using cryptography. Each block typically contains a hash pointer as a link to a previous block, a timestamp and transaction data. By design, blockchains are inherently resistant to modification of the data. \n\nA blockchain can serve as \"an open, distributed ledger that can record transactions between two parties efficiently and in a verifiable and permanent way.\" For use as a distributed ledger, a blockchain is typically managed by a peer-to-peer network collectively adhering to a protocol for validating new blocks. Once recorded, the data in any given block cannot be altered retroactively without the alteration of all subsequent blocks, which needs a collusion of the network majority.\n\nThe original, and currently most famous application of blockchain technology is to support the implementation of the virtual currency BitCoin.\n\nFor more information on blockchain, start with the [Wikipedia entry on blockchain](https://en.wikipedia.org/wiki/Blockchain).\n\nA great introduction is [Blockchains: how they work and how they'll change the world](https://spectrum.ieee.org/computing/networks/blockchains-how-they-work-and-why-theyll-change-the-world)",
          "interestType": "technologies"
        },
        {
          "name": "C and C++",
          "slug": "c",
          "description": "C is a general-purpose, imperative computer programming language, supporting structured programming, lexical variable scope and recursion, and includes a static type system that prevents many unintended operations. By design, C provides constructs that map efficiently to typical machine instructions, and therefore it has found lasting use in applications that had formerly been coded in assembly language. C++ is an object-oriented extension of C. [Learn more here.](https://en.wikipedia.org/wiki/C_(programming_language))",
          "interestType": "technologies"
        },
        {
          "name": "C#",
          "slug": "c-sharp",
          "description": "C# is a general purpose, object-oriented programming language developed by Microsoft for .NET.  It is now also used extensively for game development in the Unity platform. [Learn more here.](https://en.wikipedia.org/wiki/C_Sharp_(programming_language))",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Civic Engagement",
          "slug": "civic-engagement",
          "description": "Civic engagement means working to make a difference in the civic life of our communities and developing the combination of knowledge, skills, values and motivation to make that difference. It means promoting the quality of life in a community, through both political and non-political processes. [Learn more here.](https://en.wikipedia.org/wiki/Civic_engagement)",
          "interestType": "non-cs-disciplines"
        },
        {
          "name": "Cloud Computing",
          "slug": "cloud-computing",
          "description": "Cloud computing is the on-demand delivery of compute power, database storage, applications, and other IT resources through a cloud services platform via the internet with pay-as-you-go pricing.\n\nThe three biggest cloud computing vendors are [Amazon Web Services](https://aws.amazon.com/), [Google Cloud Platform](https://cloud.google.com/), and [Microsoft Azure](https://azure.microsoft.com/en-us/).\n\nCloud computing has three main types that are commonly referred to as Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS).\n\nHere is a [three minute introduction to Cloud Computing](https://www.youtube.com/watch?v=jOhbTAU4OPI) by Amazon Web Services.",
          "interestType": "technologies"
        },
        {
          "name": "Cognitive Science",
          "slug": "cognitive-science",
          "description": "Cognitive science is the interdisciplinary scientific study of the mind and its processes. It examines what cognition is, what it does and how it works. It includes research on intelligence and behaviour, especially focusing on how information is represented, processed, and transformed (in faculties such as perception, language, memory, attention, reasoning, and emotion) within nervous systems (humans or other animals) and machines (e.g. computers). Cognitive science includes multiple research disciplines, including psychology, artificial intelligence, philosophy, neuroscience, linguistics, and anthropology. [Learn more here.](https://en.wikipedia.org/wiki/Cognitive_science)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Computer Architecture",
          "slug": "computer-architecture",
          "description": "Computer architecture describes the functionality, organization, and implementation of computer systems. Some architectures define the capabilities and programming model of a computer but not a particular implementation. Others include instruction set design, micro-architecture design, logic design, and implementation. Computer architecture can focus on hardware or can include both hardware and software. [Learn more here.](https://en.wikipedia.org/wiki/Computer_architecture)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Computer Ethics",
          "slug": "computer-ethics",
          "description": "Computer Ethics is a part of practical philosophy which concerns with how computing professionals should make decisions regarding professional and social conduct. Computer ethics can inform issues such as copyright infringement, privacy, piracy, and social informatics. [Learn more here.](https://en.wikipedia.org/wiki/Computer_ethics)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Computer Graphics",
          "slug": "computer-graphics",
          "description": "Computer graphics are pictures and movies created using computers - usually referring to image data created by a computer specifically with help from specialized graphical hardware and software. Important topics in computer graphics include user interface design, sprite graphics, vector graphics, 3D modeling, shaders, GPU design, and computer vision. The overall methodology depends heavily on the sciences of geometry, optics, and physics. Computer graphic development has had a significant impact on many types of media and has revolutionized animation, movies, advertising, video games, and graphic design generally. [Learn more here.](https://en.wikipedia.org/wiki/Computer_graphics)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Computer Vision",
          "slug": "computer-vision",
          "description": "Computer vision is a field that includes methods for acquiring, processing, analyzing, and understanding images and, in general, high-dimensional data from the real world in order to produce numerical or symbolic information that can be used to take action. A common theme is to duplicate the abilities of human vision by electronically perceiving and understanding an image. Subdomains of computer vision include scene reconstruction, event detection, video tracking, object recognition, object pose estimation, learning, indexing, motion estimation, and image restoration. [Learn more here.](https://en.wikipedia.org/wiki/Computer_vision)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Cryptography",
          "slug": "cryptography",
          "description": "Cryptography is the study of techniques for secure communication: constructing and analyzing protocols that prevent third parties or the public from reading private messages. Data confidentiality, data integrity, authentication, and non-repudiation are central to modern cryptography. Modern cryptography exists at the intersection of mathematics, computer science, and electrical engineering. Applications of cryptography include ATM cards, computer passwords, and electronic commerce. [Learn more here.](https://en.wikipedia.org/wiki/Cryptography)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Data Mining",
          "slug": "data-mining",
          "description": "Data mining is the process of discovering patterns in large data sets involving methods at the intersection of machine learning, statistics, and database systems. Data mining is an interdisciplinary subfield of computer science and statistics with an overall goal to extract information (with intelligent methods) from a data set and transform the information into a comprehensible structure for further use.\n\nData mining is a subset of data science: while \"data science\" focuses on a broad variety of issues related to data (including data mining), data mining focuses more narrowly on the process of discovering patterns in large data sets.\n\nFor more information, see [https://en.wikipedia.org/wiki/Data_mining](https://en.wikipedia.org/wiki/Data_mining).",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Data Science",
          "slug": "data-science",
          "description": "Data science is an interdisciplinary field about processes and systems to extract knowledge or insights from data in various forms, either structured or unstructured. Data science employs techniques and theories drawn from many fields within the broad areas of mathematics, statistics, information science, and computer science, including signal processing, probability models, machine learning, statistical learning, data mining, database, data engineering, pattern recognition and learning, visualization, predictive analytics, uncertainty modeling, data warehousing, data compression, computer programming, artificial intelligence, and high performance computing. Methods that scale to big data are of particular interest in data science. Data science affects many domains, including machine translation, speech recognition, robotics, search engines, digital economy, but also the biological sciences, medical informatics, health care, social sciences and the humanities. [Learn more here.](https://en.wikipedia.org/wiki/Data_science)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Data Visualization",
          "slug": "data-visualization",
          "description": "Data visualization is both an art and a science. A primary goal of data visualization is to communicate information clearly and efficiently via statistical graphics, plots and information graphics. Numerical data may be encoded using dots, lines, or bars, to visually communicate a quantitative message. \n\nEffective visualization helps users analyze and reason about data and evidence. It makes complex data more accessible, understandable and usable. \n\n[Learn more here.](https://en.wikipedia.org/wiki/Data_visualization)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Databases",
          "slug": "databases",
          "description": "A database is an organized collection of data. It includes schemas, tables, queries, reports, views and other objects. The data are typically organized to model aspects of reality in a way that supports processes requiring information, such as modelling the availability of rooms in hotels in a way that supports finding a hotel with vacancies. Access to these data is usually provided by a \"database management system\" (DBMS) consisting of an integrated set of computer software that allows users to interact with one or more databases and provides access to all of the data contained in the database (although restrictions may exist that limit access to particular data). The DBMS provides various functions that allow entry, storage and retrieval of large quantities of information and provides ways to manage how that information is organized. [Learn more here.](https://en.wikipedia.org/wiki/Database)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Django",
          "slug": "django",
          "description": "Django is the most popular web application framework based on Python. \n\nFor more information, see [https://www.djangoproject.com/](https://www.djangoproject.com/).",
          "interestType": "technologies"
        },
        {
          "name": ".NET",
          "slug": "dotNet",
          "description": ".NET is a software framework developed by Microsoft that runs primarily on Microsoft Windows. It includes a large class library called Framework Class Library that provides user interface, data access, database connectivity, cryptography, web application development, numeric algorithms, and network communications. [Learn more here.](https://www.microsoft.com/net/)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Entrepreneurship",
          "slug": "entrepreneurship",
          "description": "Entrepreneurship is the process of designing, launching and running a new business, such as a startup company offering a product, process or service. It requires the capacity and willingness to develop, organize, and manage a business venture along with any of its risks in order to make a profit. Entrepreneurs tend to be good at perceiving new business opportunities and they often exhibit positive biases in their perception (i.e., a bias towards finding new possibilities and seeing unmet market needs) and a pro-risk-taking attitude that makes them more likely to exploit the opportunity. [Learn more here.](https://en.wikipedia.org/wiki/Entrepreneurship)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Flutter",
          "slug": "flutter",
          "description": "Flutter is a toolkit developed by Google to built native mobile, web, and desktop apps.  It is based on the Dart language. \n\nFor more details, see [https://flutter.dev/](https://flutter.dev/).",
          "interestType": "technologies"
        },
        {
          "name": "Game Design",
          "slug": "game-design",
          "description": "Game design is the art of applying design and aesthetics to create a game to facilitate interaction between players for entertainment or for medical, educational, or experimental purposes. Game design creates goals, rules, and challenges to produce desirable interactions among its participants and, possibly, spectators. [Learn more here.](https://en.wikipedia.org/wiki/Game_design)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Geographic Information Systems",
          "slug": "geographic-information-systems",
          "description": "A geographic information system (GIS) is a framework for gathering, managing, and analyzing data. Rooted in the science of geography, GIS integrates many types of data. It analyzes spatial location and organizes layers of information into visualizations using maps and 3D scenes. ​With this unique capability, GIS reveals deeper insights into data, such as patterns, relationships, and situations—helping users make smarter decisions. \n\nFor more information, see [https://www.esri.com/en-us/what-is-gis/overview](https://www.esri.com/en-us/what-is-gis/overview).",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Golang",
          "slug": "golang",
          "description": "Go is an open source programming language that makes it easy to build simple, reliable, and efficient software.\n\nAccording to its developers, \"Go is expressive, concise, clean, and efficient. Its concurrency mechanisms make it easy to write programs that get the most out of multicore and networked machines, while its novel type system enables flexible and modular program construction. Go compiles quickly to machine code yet has the convenience of garbage collection and the power of run-time reflection. It's a fast, statically typed, compiled language that feels like a dynamically typed, interpreted language.\"\n\nFor more information, see [https://golang.org/](https://golang.org/).",
          "interestType": "technologies"
        },
        {
          "name": "Graphic Design",
          "slug": "graphic-design",
          "description": "Graphic design is the process of visual communication and problem-solving using one or more of typography, photography and illustration. [Learn more here.](https://en.wikipedia.org/wiki/Graphic_design)",
          "interestType": "non-cs-disciplines"
        },
        {
          "name": "GraphQL",
          "slug": "graphql",
          "description": "GraphQL is a query language for APIs and a runtime for fulfilling those queries with your existing data. Basically, it provides a uniform way to query both relational (Postgres,MySQL) and non-relational (MongoDB) databases. \n\nAccording to the developers, \"GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools.\"\n\nFor more information, see [https://graphql.org/](https://graphql.org/).",
          "interestType": "technologies"
        },
        {
          "name": "Hardware",
          "slug": "hardware",
          "description": "Computer hardware is the physical parts or components of a computer, such as the monitor, mouse, keyboard, computer data storage, hard disk drive (HDD), graphic cards, sound cards, memory (RAM), motherboard, and so on, all of which are tangible physical objects. By contrast, software is instructions that can be stored and run by hardware. [Learn more here.](https://en.wikipedia.org/wiki/Computer_hardware)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Human-Computer Interaction",
          "slug": "hci",
          "description": "Researchers in the field of HCI both observe the ways in which humans interact with computers and design technologies that let humans interact with computers in novel ways. Human-computer interaction is situated at the intersection of computer science, behavioral sciences, design, and media studies. [Learn more here.](https://en.wikipedia.org/wiki/Human%E2%80%93computer_interaction)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "High Performance Computing",
          "slug": "hpc",
          "description": "High Performance Computing concerns the hardware and software capabilities required for effective use of \"supercomputers\". HPC techniques are needed for computationally intensive tasks in various fields, including quantum mechanics, weather forecasting, climate research, oil and gas exploration, molecular modeling (computing the structures and properties of chemical compounds, biological macromolecules, polymers, and crystals), and physical simulations (such as simulations of the early moments of the universe, airplane and spacecraft aerodynamics, the detonation of nuclear weapons, and nuclear fusion). Throughout their history, they have been essential in the field of cryptanalysis. [Learn more here.](https://en.wikipedia.org/wiki/Supercomputer)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Internet of Things",
          "slug": "internet-of-things",
          "description": "According to Limor Fried: The Internet of Things is all about connections—connecting your electronics design, product, or project to the wider world. We start with the idea that you have a \"Thing\" that you want to connect to the \"Internet of.” How do you do that? Usually you start with something you’d like to improve. Say you love fish and have a home or school aquarium. Since you’ve got some really fancy fish, they need the water temperature to stay between 20 and 30 degrees Centigrade. You could always check the water temperature, but it would be better if you had a microcontroller to help you out! You could start with a simple temperature manager, but even better would be one that could email or text you to let you know if something went amiss and maybe the heater broke. That’s what the Internet of Things is all about: Making stuff smart!\"\n\nLimor \"Ladyada\" Fried is the founder and CEO of Adafruit Industries, an open-source hardware company. A founding member of the NYC Industrial Business Advisory Council, she was named a White House Champion of Change in 2016.  See the [rest of her article on Internet of Things](https://news.codecademy.com/internet-of-things/).",
          "interestType": "technologies"
        },
        {
          "name": "iOS",
          "slug": "ios",
          "description": "iOS is a mobile operating system developed by Apple Inc. exclusively for its hardware. It is the OS for the iPhone, iPad, and iPod. As of January 2017, Apple's AppStore contains more than 2.2 million iOS applications. [Learn more here.](http://www.apple.com/ios/",
          "interestType": "cs-disciplines"
        },
        {
          "name": "IT Management",
          "slug": "it-management",
          "description": "IT management is the discipline whereby all of the information technology resources of a firm are managed in accordance with its needs and priorities. These resources may include tangible investments like computer hardware, software, data, networks and data centre facilities, as well as the staff who are hired to maintain them. Managing this responsibility within a company entails many of the basic management functions, like budgeting, staffing, change management, and organizing and controlling, along with other aspects that are unique to technology, like software design, network planning, tech support etc. [Learn more here.](https://en.wikipedia.org/wiki/Information_technology_management)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Java",
          "slug": "java",
          "description": "Java is a general-purpose computer programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible. It is intended to let application developers \"write once, run anywhere\", meaning that compiled Java code can run on all platforms that support Java without the need for recompilation. Java applications are typically compiled to bytecode that can run on any Java virtual machine regardless of computer architecture. As of 2016, Java is one of the most popular programming languages in use, particularly for client-server web applications, with a reported 9 million developers. [Learn more here.](https://en.wikipedia.org/wiki/Java_(programming_language))",
          "interestType": "technologies"
        },
        {
          "name": "Javascript",
          "slug": "javascript",
          "description": "JavaScript is a high-level, dynamic, untyped, and interpreted programming language. Despite some syntactic similarities, JavaScript and Java are otherwise unrelated and have very different semantics. Alongside HTML and CSS, Javascript is one of the three core technologies of World Wide Web content production; the majority of websites employ it and it is supported by all modern Web browsers without plug-ins. JavaScript is prototype-based with first-class functions, making it a multi-paradigm language, supporting object-oriented, imperative, and functional programming styles. It has an API for working with text, arrays, dates and regular expressions, but does not include any I/O, such as networking, storage, or graphics facilities, relying for these upon the host environment in which it is embedded. [Learn more here.](https://en.wikipedia.org/wiki/JavaScript)",
          "interestType": "technologies"
        },
        {
          "name": "Jupyter",
          "slug": "jupyter",
          "description": "A Jupyter Notebook combines live code, graphics, visualizations, and text in shareable notebooks that run in a web browser. \n\nJupyter is most commonly used to develop data science applications in Python, although it now has language bindings for [most of the common languages](https://github.com/jupyter/jupyter/wiki/Jupyter-kernels). \n\nSome of the key capabilities of Jupyter include:\n\n  * Data visualizations. Most people have their first exposure to Jupyter Notebook by way of a data visualization, a shared notebook that includes a rendering of some data set as a graphic. Jupyter Notebook lets you author visualizations, but also share them and allow interactive changes to the shared code and data set.\n\n  * Code sharing. Cloud services like GitHub and Pastebin provide ways to share code, but they’re largely non-interactive. With a Jupyter Notebook, you can view code, execute it, and display the results directly in your web browser.\n\n  * Live interactions with code. Jupyter Notebook code isn’t static; it can be edited and re-run incrementally in real time, with feedback provided directly in the browser. Notebooks can also embed user controls (e.g., sliders or text input fields) that can be used as input sources for code.\n\n  * Documenting code samples. If you have a piece of code and you want to explain line-by-line how it works, with live feedback all along the way, you could embed it in a Jupyter Notebook. Best of all, the code will remain fully functional—you can add interactivity along with the explanation, showing and telling at the same time.\n\nFor more information, see [https://jupyter.org/](https://jupyter.org/)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Kotlin",
          "slug": "kotlin",
          "description": "Kotlin is a programming language developed by JetBrains which is syntactically similar to Java. It can compile to JVM, but also to Javascript, making it possible to write Kotlin applications that run in the browser. \n\nFor more information, see [https://kotlinlang.org/](https://kotlinlang.org/).",
          "interestType": "technologies"
        },
        {
          "name": "Laravel",
          "slug": "laravel",
          "description": "Laravel is a web application development environment for PHP.  Laravel provides built-in facilities for many common web development issues, including MVC, authentication, routing, sessions, and caching.\n\nFor more information, see [https://laravel.com/](https://laravel.com/).",
          "interestType": "technologies"
        },
        {
          "name": "Linux",
          "slug": "linux",
          "description": "A Unix-like and mostly POSIX-compliant computer operating system (OS) assembled under the model of free and open-source software development and distribution. Linux was originally developed as a free operating system for personal computers based on the Intel x86 architecture, but has since been ported to more computer hardware platforms than any other operating system. Because of the dominance of Android on smartphones, Linux has the largest installed base of all general-purpose operating systems. [Learn more here.](https://en.wikipedia.org/wiki/Linux)",
          "interestType": "technologies"
        },
        {
          "name": "Lisp",
          "slug": "lisp",
          "description": "Lisp is a family of computer programming languages with a long history and a distinctive, fully parenthesized prefix notation. Originally specified in 1958, Lisp is the second-oldest high-level programming language in widespread use today; only Fortran is older (by one year). Lisp was originally created as a practical mathematical notation for computer programs, influenced by the notation of Alonzo Church's lambda calculus. It quickly became the favored programming language for artificial intelligence (AI) research. As one of the earliest programming languages, Lisp pioneered many ideas in computer science, including tree data structures, automatic storage management, dynamic typing, conditionals, higher-order functions, recursion, and the self-hosting compiler. [Learn more here.](https://en.wikipedia.org/wiki/Lisp_(programming_language))",
          "interestType": "technologies"
        },
        {
          "name": "Machine Learning",
          "slug": "machine-learning",
          "description": "Machine learning is a subfield of computer science that evolved from the study of pattern recognition and computational learning theory in artificial intelligence. Machine learning explores the study and construction of algorithms that can learn from and make predictions on data. Such algorithms operate by building a model from example inputs in order to make data-driven predictions or decisions expressed as outputs. Machine learning is employed in a range of computing tasks where designing and programming explicit algorithms is infeasible. Example applications include spam filtering, optical character recognition (OCR), search engines, and computer vision. [Learn more here.](https://en.wikipedia.org/wiki/Machine_learning)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Mobile Computing",
          "slug": "mobile",
          "description": "Mobile computing is human–computer interaction by which a computer is expected to be transported during normal usage, which allows for transmission of data, voice and video. Mobile computing involves mobile communication, mobile hardware, and mobile software. Communication issues include ad hoc networks and infrastructure networks as well as communication properties, protocols, data formats and concrete technologies. Hardware includes mobile devices or device components. Mobile software deals with the characteristics and requirements of mobile applications. [Learn more here.](https://en.wikipedia.org/wiki/Mobile_computing)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Natural Language Processing",
          "slug": "natural-language-processing",
          "description": "Natural language processing (NLP) is a field of computer science, artificial intelligence and computational linguistics concerned with the interactions between computers and human (natural) languages, and, in particular, concerned with programming computers to fruitfully process large natural language corpora. Challenges in natural language processing frequently involve natural language understanding, natural language generation (frequently from formal, machine-readable logical forms), connecting language and machine perception, dialog systems, or some combination thereof.\n\nFor more information, see the [Natural Language Processing Wikipedia Page](https://en.wikipedia.org/wiki/Natural_language_processing).",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Networks",
          "slug": "networks",
          "description": "A computer network or data network is a telecommunications network which allows computers to exchange data. In computer networks, networked computing devices exchange data with each other using a data link. The connections between nodes are established using either cable media or wireless media. The best-known computer network is the Internet. [Learn more here.](https://en.wikipedia.org/wiki/Computer_network)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "NodeJS",
          "slug": "nodejs",
          "description": "Node.js is an open-source, cross-platform JavaScript run-time environment that executes JavaScript code outside of a browser. Node.js lets developers use JavaScript to write command line tools and for server-side scripting—running scripts server-side to produce dynamic web page content before the page is sent to the user's web browser. Consequently, Node.js represents a \"JavaScript everywhere\" paradigm unifying web application development around a single programming language, rather than different languages for server- and client-side scripts.\n\nFor more information, see [https://nodejs.org/en/](https://nodejs.org/en/).",
          "interestType": "technologies"
        },
        {
          "name": "Operating Systems",
          "slug": "operating-systems",
          "description": "An operating system (OS) is system software that manages computer hardware and software resources and provides common services for computer programs. Examples of popular desktop operating systems include Apple OS X, Linux and its variants, and Microsoft Windows. So-called mobile operating systems include Android and iOS. Other classes of operating systems, such as real-time (RTOS), also exist. [Learn more here.](https://en.wikipedia.org/wiki/Operating_system)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Parallel Programming",
          "slug": "parallel-programming",
          "description": "Parallel programming refers to a type of computation in which many calculations are carried out simultaneously, operating on the principle that large problems can often be divided into smaller ones, which are then solved at the same time. In some cases parallelism is transparent to the programmer, such as in bit-level or instruction-level parallelism, but explicitly parallel algorithms, particularly those that use concurrency, are more difficult to write than sequential ones, because concurrency introduces several new classes of potential software bugs, of which race conditions are the most common. Communication and synchronization between the different subtasks are typically some of the greatest obstacles to getting good parallel program performance. [Learn more here.](https://en.wikipedia.org/wiki/Parallel_computing)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Perl",
          "slug": "perl",
          "description": "Perl is a family of high-level, general-purpose, interpreted, dynamic programming languages. Perl 5 is used for graphics programming, system administration, network programming, finance, bioinformatics, and other applications. It has been nicknamed \"the Swiss Army chainsaw of scripting languages\" because of its flexibility and power, and possibly also because of its \"ugliness\". In 1998, it was also referred to as the \"duct tape that holds the Internet together\", in reference to both its ubiquitous use as a glue language and its perceived inelegance. [Learn more here.](https://www.perl.org/)",
          "interestType": "technologies"
        },
        {
          "name": "Prolog",
          "slug": "prolog",
          "description": "Prolog is a general-purpose logic programming language associated with artificial intelligence and computational linguistics. Prolog has its roots in first-order logic, a formal logic, and unlike many other programming languages, Prolog is declarative: the program logic is expressed in terms of relations, represented as facts and rules. The language has been used for theorem proving, expert systems, as well as its original intended field of use, natural language processing. [Learn more here.](https://en.wikipedia.org/wiki/Prolog)",
          "interestType": "technologies"
        },
        {
          "name": "Psychology",
          "slug": "psychology",
          "description": "The scientific study of the human mind and its functions, especially those affecting behavior in a given context. [Learn more here.](https://en.wikipedia.org/wiki/Psychology)",
          "interestType": "non-cs-disciplines"
        },
        {
          "name": "Python",
          "slug": "python",
          "description": "Python is a widely used high-level, general-purpose, interpreted, dynamic programming language. Its design philosophy emphasizes code readability, and its syntax allows programmers to express concepts in fewer lines of code than would be possible in languages such as C++ or Java. Python supports multiple programming paradigms, including object-oriented, imperative and functional programming or procedural styles. It features a dynamic type system and automatic memory management and has a large and comprehensive standard library. [Learn more here.](https://www.python.org/)",
          "interestType": "technologies"
        },
        {
          "name": "Quantum Computing",
          "slug": "quantum-computing",
          "description": "Quantum computing is computing using quantum-mechanical phenomena, such as superposition and entanglement.  A quantum computer is a device that performs quantum computing. They are different from binary digital electronic computers based on transistors. Whereas common digital computing requires that the data be encoded into binary digits (bits), each of which is always in one of two definite states (0 or 1), quantum computation uses quantum bits, which can be in superpositions of states. \n\nLarge-scale quantum computers would theoretically be able to solve certain problems much more quickly than any classical computers that use even the best currently known algorithms, like integer factorization using Shor's algorithm (which is a quantum algorithm) and the simulation of quantum many-body systems. There exist quantum algorithms, such as Simon's algorithm, that run faster than any possible probabilistic classical algorithm.\n\nFor more information on Quantum Computing, you can start with the [Wikipedia Entry](https://en.wikipedia.org/wiki/Quantum_computing). There's also an article from Wired, [What are quantum computers and how do they work?](http://www.wired.co.uk/article/quantum-computing-explained). MIT's Technology Review has an article [Serious quantum computers are finally here. What are we going to do with them?](http://www.wired.co.uk/article/quantum-computing-explained).  Finally, there's a 7 minute YouTube video, [Quantum Computers Explained](https://www.youtube.com/watch?v=JhHMJCUmq28), with over 7M views (so it must be good!)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "R",
          "slug": "r",
          "description": "[R](https://www.r-project.org/) is a programming language and software environment that is widely used among statisticians and data miners for developing statistical software and data analysis. R and its libraries implement a wide variety of statistical and graphical techniques, including linear and nonlinear modeling, classical statistical tests, time-series analysis, classification, clustering, and others. \n\nThe R environment includes:\n\n* an effective data handling and storage facility,\n* a suite of operators for calculations on arrays, in particular matrices,\n* a large, coherent, integrated collection of intermediate tools for data analysis,\n* graphical facilities for data analysis and display either on-screen or on hardcopy, and\n* a well-developed, simple and effective programming language which includes conditionals, loops, user-defined recursive functions and input and output facilities.\n\nIn the 2017 version of the Tiobe Index of Programming Languages, R was eighth on the list. That's a significant rise since December 2016, when R was 17th on the index.",
          "interestType": "technologies"
        },
        {
          "name": "React",
          "slug": "react",
          "description": "Created by Facebook, [React](https://reactjs.org/) is an open source JavaScript library for creating interactive user interfaces. It is often used along with [React Native](http://facebook.github.io/react-native/) to create cross-platform mobile apps that run natively on both iOS and Android devices. Recently, it's become tremendously popular with mobile developers. According to GitHub, it was the seventh most frequently forked open source project in 2017, and React Native was the project with the second most contributors.\n\nIn an [Indeed study from December 2017](http://www.hiringlab.org/2017/12/06/important-skills-in-tech-job-searches/), React was by far and away the fastest-growing job skill from both a job seeker and an employer point of view. Employer searches for the term increased by 229% in 2017, while job seeker searches skyrocketed 313%.",
          "interestType": "technologies"
        },
        {
          "name": "Research",
          "slug": "research",
          "description": "Research comprises \"creative work undertaken on a systematic basis in order to increase the stock of knowledge, including knowledge of humans, culture and society, and the use of this stock of knowledge to devise new applications.\" [Learn more here.](https://en.wikipedia.org/wiki/Research)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Robotics",
          "slug": "robotics",
          "description": "Robotics is the branch of mechanical engineering, electrical engineering and computer science that deals with the design, construction, operation, and application of robots, as well as computer systems for their control, sensory feedback, and information processing. Robots can take the place of humans in dangerous environments or manufacturing processes, or resemble humans in appearance, behaviour, and or cognition. Many robots are inspired by nature contributing to the field of bio-inspired robotics. [Learn more here.](https://en.wikipedia.org/wiki/Robotics)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Ruby",
          "slug": "ruby",
          "description": "Ruby is a dynamic, reflective, object-oriented, general-purpose programming language. Ruby was influenced by Perl, Smalltalk, Eiffel, Ada, and Lisp. It supports multiple programming paradigms, including functional, object-oriented, and imperative. It also has a dynamic type system and automatic memory management. Ruby's creator, Yukihiro Matsumoto, has stated, \"I hope to see Ruby help every programmer in the world to be productive, and to enjoy programming, and to be happy. That is the primary purpose of Ruby language.\" [Learn more here.](http://www.ruby-lang.org/en/)",
          "interestType": "technologies"
        },
        {
          "name": "Rust",
          "slug": "rust",
          "description": "The Rust programming language is designed to support low-level access to hardware (like C and C++) while addressing some of the pitfalls of those languages. Rust is syntactically similar to C++, but it provides [increased speed and better memory safety](https://www.apriorit.com/dev-blog/520-rust-vs-c-comparison). \n\nFor more information, see [https://www.rust-lang.org/](https://www.rust-lang.org/).",
          "interestType": "technologies"
        },
        {
          "name": "Security",
          "slug": "security",
          "description": "Computer security, also known as cybersecurity or IT security, is the protection of information systems from theft or damage to the hardware, the software, and to the information on them, as well as from disruption or misdirection of the services they provide. It includes controlling physical access to the hardware, as well as protecting against harm that may come via network access, data and code injection, and due to malpractice by operators, whether intentional, accidental, or due to them being tricked into deviating from secure procedures. [Learn more here.](https://en.wikipedia.org/wiki/Computer_security)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Social Computing",
          "slug": "social-computing",
          "description": "Social computing is an area of computer science that is concerned with the intersection of social behavior and computational systems. It is based on creating or recreating social conventions and social contexts through the use of software and technology. Thus, blogs, email, instant messaging, social network services, wikis, social bookmarking and other instances of what is often called social software illustrate ideas from social computing.\n\nFor more details, see:\n\n  * [Wikipedia entry on social computing](https://en.wikipedia.org/wiki/Social_computing)\n  * [Social Computing 101: The Basics](https://www.interaction-design.org/literature/article/social-computing-101-the-basics)\n  * [MIT Media Lab Social Computing Group](https://www.media.mit.edu/groups/social-computing/overview/)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Software Engineering",
          "slug": "software-engineering",
          "description": "The systematic application of scientific and technological knowledge, methods, and experience to the design, implementation, testing, and documentation of software. The discipline of software engineering was created to address poor quality of software, get projects exceeding time and budget under control, and ensure that software is built systematically, rigorously, measurably, on time, on budget, and within specification. In 2012, Software Engineering was ranked as the best job in the United States by CareerCast.com. \n\n[Learn more here.](https://en.wikipedia.org/wiki/Software_engineering)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "SQL",
          "slug": "sql",
          "description": "SQL (Structured Query Language) is a special-purpose programming language designed for managing data held in a relational database management system , or for stream processing in a relational data stream management system. Originally based upon relational algebra and tuple relational calculus, SQL consists of a data definition language, data manipulation language, and a data control language. The scope of SQL includes data insert, query, update and delete, schema creation and modification, and data access control. [Learn more here.](https://en.wikipedia.org/wiki/SQL)",
          "interestType": "technologies"
        },
        {
          "name": "Sustainability",
          "slug": "sustainability",
          "description": "In ecology, sustainability (from sustain and ability) is the property of biological systems to remain diverse and productive indefinitely. Long-lived and healthy wetlands and forests are examples of sustainable biological systems. In more general terms, sustainability is the endurance of systems and processes. The organizing principle for sustainability is sustainable development, which includes the four interconnected domains: ecology, economics, politics and culture. Sustainability science is the study of sustainable development and environmental science. [Learn more here.](https://en.wikipedia.org/wiki/Sustainability)",
          "interestType": "non-cs-disciplines"
        },
        {
          "name": "Swift",
          "slug": "swift",
          "description": "According to Apple, \"Swift is a powerful and intuitive programming language for macOS, iOS, watchOS, tvOS and beyond. Writing Swift code is interactive and fun, the syntax is concise yet expressive, and Swift includes modern features developers love. Swift code is safe by design, yet also produces software that runs lightning-fast.\"\n\nSwift is the result of the latest research on programming languages, combined with decades of experience building Apple platforms. Named parameters are expressed in a clean syntax that makes APIs in Swift even easier to read and maintain. Even better, you don’t even need to type semi-colons. Inferred types make code cleaner and less prone to mistakes, while modules eliminate headers and provide namespaces. To best support international languages and emoji, Strings are Unicode-correct and use a UTF-8 based encoding to optimize performance for a wide-variety of use cases. Memory is managed automatically using tight, deterministic reference counting, keeping memory usage to a minimum without the overhead of garbage collection.\n\nFor more information, see [https://developer.apple.com/swift/](https://developer.apple.com/swift/)",
          "interestType": "technologies"
        },
        {
          "name": "Teaching",
          "slug": "teaching",
          "description": "Teaching is the process of facilitating learning, or the acquisition of knowledge, skills, values, beliefs, and habits. Educational methods include storytelling, discussion, teaching, training, and directed research. [Learn more here.](https://en.wikipedia.org/wiki/Education)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Theory of computation",
          "slug": "theory-of-computation",
          "description": "Theory of computation deals with how efficiently problems can be solved on a model of computation, using an algorithm. The field is divided into three major branches: automata theory and language, computability theory, and computational complexity theory, which are linked by the question: \"What are the fundamental capabilities and limitations of computers?\". [Learn more here.](https://en.wikipedia.org/wiki/Theory_of_computation)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Typescript",
          "slug": "typescript",
          "description": "Typescript is a typed superset of Javascript that compiles to Javascript. Types enable JavaScript developers to use development tools and practices like static checking and code refactoring when developing JavaScript applications.\n\nTypes are optional, and type inference allows a few type annotations to make a big difference to the static verification of your code. Types let you define interfaces between software components and gain insights into the behavior of existing JavaScript libraries.\n\nFor more information, see [https://www.typescriptlang.org/](https://www.typescriptlang.org/).",
          "interestType": "technologies"
        },
        {
          "name": "Unity",
          "slug": "unity",
          "description": "Unity is a cross-platform game engine developed by Unity Technologies and used to develop video games for PC, consoles, mobile devices and websites. First announced only for OS X, at Apple's Worldwide Developers Conference in 2005, it has since been extended to target 27 platforms. Nintendo provides free licenses of Unity 5 to all licensed Nintendo Developers along with their software development kits (SDKs) for the Wii U and Nintendo 3DS Family. [Learn more here.](https://unity3d.com/)",
          "interestType": "technologies"
        },
        {
          "name": "Virtual Reality",
          "slug": "virtual-reality",
          "description": "Virtual reality (VR) typically refers to computer technologies that use software to generate realistic images, sounds and other sensations that replicate a real environment (or create an imaginary setting), and simulate a user's physical presence in this environment. VR has been defined as \"...a realistic and immersive simulation of a three-dimensional environment, created using interactive software and hardware, and experienced or controlled by movement of the body\" or as an \"immersive, interactive experience generated by a computer\". [Learn more here.](https://en.wikipedia.org/wiki/Virtual_reality)",
          "interestType": "cs-disciplines"
        },
        {
          "name": "Web Development",
          "slug": "web-development",
          "description": "In computing, a web application or web app is a client–server software application in which the client (or user interface) runs in a web browser. Common web applications include webmail, online retail sales, online auctions, wikis, instant messaging services and many other functions. [Learn more here.](https://en.wikipedia.org/wiki/Web_application)",
          "interestType": "cs-disciplines"
        }
      ]
    },
    {
      "name": "InterestTypeCollection",
      "contents": [
        {
          "name": "CS Disciplines",
          "slug": "cs-disciplines",
          "description": "Computer science and engineering areas of interest, not including languages, tools, technologies.",
          "retired": false
        },
        {
          "name": "Non-CS Disciplines",
          "slug": "non-cs-disciplines",
          "description": "Areas of interest apart from computer science and engineering.",
          "retired": false
        },
        {
          "name": "technologies",
          "slug": "technologies",
          "description": "Computer science and engineering languages, tools, and technologies",
          "retired": false
        }
      ]
    },
    {
      "name": "MentorAnswerCollection",
      "contents": []
    },
    {
      "name": "MentorProfileCollection",
      "contents": [
        {
          "username": "rbrewer@excitedcuriosity.org",
          "firstName": "Robert",
          "lastName": "Brewer",
          "picture": "/images/mentors/brewer.jpg",
          "interests": [
            "algorithms",
            "data-science",
            "data-visualization",
            "entrepreneurship",
            "hci",
            "research",
            "software-engineering",
            "sustainability"
          ],
          "careerGoals": [
            "data-scientist",
            "database-administrator",
            "devops-engineer",
            "game-developer",
            "graduate-school",
            "information-system-manager",
            "network-engineer",
            "research-scientist",
            "software-developer",
            "startup-cofounder",
            "teacher",
            "ux-designer"
          ],
          "company": "Tableau",
          "career": "Software Engineer",
          "location": "Palo Alto, CA",
          "linkedin": "robertsbrewer",
          "motivation": "I founded a startup in Hawaii and now work in Silicon Valley. I am happy to share my experiences with new grads.",
          "retired": false
        },
        {
          "username": "jgeis@hawaii.edu",
          "firstName": "Jennifer",
          "lastName": "Geis",
          "picture": "/images/mentors/geis.jpg",
          "interests": [
            "application-development",
            "civic-engagement",
            "data-science",
            "data-visualization",
            "it-management",
            "software-engineering",
            "web-development"
          ],
          "careerGoals": [
            "graduate-school",
            "information-system-manager",
            "software-developer"
          ],
          "company": "UH",
          "career": "IT Specialist",
          "location": "Honolulu, HI",
          "linkedin": "jgeis",
          "motivation": "I received both a B.S. and M.S. in Computer Science from UH. I've worked in the private sector and done the start-up thing and now work at UH Information and Technology Services. Being from Hawaii my goal was to orient my career so I could stay here and I've learned some lessons along the way. My experiences could prove useful to you if: (a) you want to talk about getting the most out of your UH ICS experience, or (b) you are interested in one day working for UH, or (c) staying in Hawaii is one of your goals.",
          "retired": false
        },
        {
          "username": "austen.ito@gmail.com",
          "firstName": "Austen",
          "lastName": "Ito",
          "picture": "/images/mentors/ito.png",
          "interests": [
            "entrepreneurship",
            "game-design",
            "mobile",
            "robotics",
            "software-engineering",
            "web-development"
          ],
          "careerGoals": [
            "iot-architect",
            "robotics-engineer",
            "software-developer",
            "startup-cofounder",
            "ux-designer"
          ],
          "company": "Bonobos",
          "career": "Software Engineer",
          "location": "New York City, NY",
          "linkedin": "austen-ito-9a561a9",
          "motivation": "I graduated from ICS, helped start the first Honolulu Makerspace, have worked for Code Camps, and have held software jobs in DC, NYC, and HI. I can try to help you whether you intend to stay local or move to the mainland.",
          "retired": false
        },
        {
          "username": "kagawaa@gmail.com",
          "firstName": "Aaron",
          "lastName": "Kagawa",
          "picture": "/images/mentors/kagawa.jpg",
          "interests": [
            "application-development",
            "civic-engagement",
            "data-visualization",
            "entrepreneurship",
            "it-management",
            "software-engineering"
          ],
          "careerGoals": [
            "data-scientist",
            "devops-engineer",
            "graduate-school",
            "information-system-manager",
            "software-developer",
            "startup-cofounder"
          ],
          "company": "LiveAction",
          "career": "Software Engineer",
          "location": "Honolulu, HI",
          "linkedin": "aaronkagawa",
          "motivation": "As an ICS undergrad and graduate student, I know how important mentoring can be to your career, and I hope I can help future ICS grads get off to a great start.",
          "retired": false
        },
        {
          "username": "pkarjala@hawaii.edu",
          "firstName": "Patrick",
          "lastName": "Karjala",
          "picture": "/images/mentors/karjala.jpg",
          "interests": [
            "application-development",
            "it-management",
            "web-development"
          ],
          "careerGoals": [
            "software-developer",
            "ux-designer"
          ],
          "company": "Slickage Studios",
          "career": "CEO",
          "location": "Honolulu, HI",
          "linkedin": "patrickakarjala",
          "motivation": "I completed my undergraduate CS degree in 2004, and am now enrolled in the UH ICS MS program. I currently work for the Distance Course Design and Consulting group at UH Manoa, doing full stack web application development. I am glad to answer questions regarding any topic of computer science, especially those geared toward collaborative development and networking (both computer and interpersonal).",
          "retired": false
        },
        {
          "username": "gelee@hawaii.edu",
          "firstName": "George",
          "lastName": "Lee",
          "picture": "/images/mentors/lee.jpg",
          "interests": [
            "algorithms",
            "application-development",
            "civic-engagement",
            "databases",
            "entrepreneurship",
            "it-management",
            "software-engineering",
            "web-development"
          ],
          "careerGoals": [
            "devops-engineer",
            "full-stack-developer",
            "game-developer",
            "graduate-school",
            "iot-architect",
            "mobile-app-developer",
            "software-developer",
            "startup-cofounder",
            "teacher",
            "ux-designer"
          ],
          "company": "Hobnob Invites",
          "career": "Developer",
          "location": "Honolulu, HI",
          "linkedin": "keokilee",
          "motivation": "I founded a startup in Hawaii and now work in Silicon Valley. I am happy to share my experiences with new grads.",
          "retired": false
        },
        {
          "username": "dan@ikayzo.com",
          "firstName": "Daniel",
          "lastName": "Leuck",
          "picture": "/images/mentors/leuck.jpg",
          "interests": [
            "algorithms",
            "application-development",
            "artificial-intelligence",
            "civic-engagement",
            "cryptography",
            "data-science",
            "entrepreneurship",
            "it-management",
            "mobile",
            "software-engineering",
            "web-development"
          ],
          "careerGoals": [
            "data-scientist",
            "devops-engineer",
            "full-stack-developer",
            "game-developer",
            "information-system-manager",
            "mobile-app-developer",
            "software-developer",
            "startup-cofounder",
            "ux-designer"
          ],
          "company": "Ikayzo",
          "career": "CEO",
          "location": "Honolulu, HI",
          "linkedin": "dleuck",
          "motivation": "The UH ICS Department is an engine for the high tech industry in Hawaii. The better prepared we can make ICS graduates, the more success our industry will have and the more opportunities there will be for all.",
          "retired": false
        },
        {
          "username": "yuka@excitedcuriosity.org",
          "firstName": "Yuka",
          "lastName": "Nagashima",
          "picture": "/images/mentors/nagashima.jpg",
          "interests": [
            "application-development",
            "civic-engagement",
            "entrepreneurship",
            "it-management"
          ],
          "careerGoals": [
            "software-developer",
            "startup-cofounder",
            "teacher"
          ],
          "company": "Paideia Enterprises",
          "career": "Owner",
          "location": "San Francisco, CA",
          "linkedin": "yukanagashima",
          "motivation": "I was the Executive Director of the High Technology Development Corporation for the State of Hawaii from 2006 to 2013, co-founded startups, and have a continuing interest in supporting the growth of the Hawaii high tech industry. I can also provide advice to those interested in moving to Silicon Valley after graduation.",
          "retired": false
        }
      ]
    },
    {
      "name": "MentorQuestionCollection",
      "contents": []
    },
    {
      "name": "OpportunityCollection",
      "contents": [
        {
          "name": "Teaching or Tutoring",
          "slug": "teaching-or-tutoring",
          "description": "There are opportunities to be a lab assistant, or serve as a tutor in the [Nat Sci Learning emporium](http://natsci.manoa.hawaii.edu/learningemporium.php).  If you want to gain experience teaching or tutoring, this opportunity is for you! \n\n#### Verification criteria\nAt the conclusion of the teaching or tutoring job, request that this Opportunity's sponsor login to RadGrad to verify your participation. You should be able to supply evidence of participation, and contact details for your supervisor at the organization.",
          "opportunityType": "project",
          "sponsor": "ticktin@hawaii.edu",
          "ice": {
            "i": 0,
            "c": 0,
            "e": 20
          },
          "interests": [
            "teaching"
          ],
          "academicTerms": [
            "Fall-2019",
            "Spring-2020",
            "Summer-2020",
            "Fall-2020",
            "Spring-2021"
          ],
          "retired": false
        }
      ]
    },
    {
      "name": "OpportunityInstanceCollection",
      "contents": []
    },
    {
      "name": "OpportunityTypeCollection",
      "contents": [
        {
          "name": "Club",
          "slug": "club",
          "description": "A student club or professional organization related to computer science.",
          "retired": false
        },
        {
          "name": "Event",
          "slug": "event",
          "description": "An event related to computer science.",
          "retired": false
        },
        {
          "name": "Internship",
          "slug": "internship",
          "description": "An internship related to computer science.",
          "retired": false
        },
        {
          "name": "Online Learning",
          "slug": "online-learning",
          "description": "A course or other extracurricular online learning opportunity.",
          "retired": false
        },
        {
          "name": "Project",
          "slug": "project",
          "description": "A project related to computer science.",
          "retired": false
        }
      ]
    },
    {
      "name": "PlanChoiceCollection",
      "contents": []
    },
    {
      "name": "ReviewCollection",
      "contents": []
    },
    {
      "name": "StudentProfileCollection",
      "contents": [
        {
          "username": "abi@hawaii.edu",
          "firstName": "Abigail",
          "lastName": "Kealoha",
          "picture": "/images/mockup/abi.jpg",
          "website": "http://abi.github.io",
          "interests": [],
          "careerGoals": [],
          "level": 1,
          "profileCourses": [],
          "profileOpportunities": [],
          "declaredAcademicTerm": "Fall-2017",
          "isAlumni": false,
          "retired": false,
          "shareUsername": false,
          "sharePicture": false,
          "shareWebsite": false,
          "shareInterests": false,
          "shareCareerGoals": false,
          "shareOpportunities": false,
          "shareCourses": false,
          "shareLevel": false
        },
        {
          "username": "alfred@hawaii.edu",
          "firstName": "Alfred",
          "lastName": "Persona",
          "picture": "/images/mockup/alfred.png",
          "website": "",
          "interests": [],
          "careerGoals": [],
          "level": 6,
          "profileCourses": [],
          "profileOpportunities": [],
          "declaredAcademicTerm": "Fall-2018",
          "isAlumni": false,
          "retired": false,
          "shareUsername": false,
          "sharePicture": false,
          "shareWebsite": false,
          "shareInterests": false,
          "shareCareerGoals": false,
          "shareOpportunities": false,
          "shareCourses": false,
          "shareLevel": false
        },
        {
          "username": "betty@hawaii.edu",
          "firstName": "Betty",
          "lastName": "Keanu",
          "picture": "/images/mockup/betty.jpg",
          "website": "http://keanu.github.io/",
          "interests": [],
          "careerGoals": [],
          "level": 4,
          "profileCourses": [],
          "profileOpportunities": [],
          "declaredAcademicTerm": "Fall-2019",
          "isAlumni": false,
          "retired": false,
          "shareUsername": false,
          "sharePicture": false,
          "shareWebsite": false,
          "shareInterests": false,
          "shareCareerGoals": false,
          "shareOpportunities": false,
          "shareCourses": false,
          "shareLevel": false
        },
        {
          "username": "charley@hawaii.edu",
          "firstName": "Charley",
          "lastName": "Sherry",
          "picture": "/images/mockup/charley.jpg",
          "website": "",
          "interests": [],
          "careerGoals": [],
          "level": 2,
          "profileCourses": [],
          "profileOpportunities": [],
          "isAlumni": false,
          "retired": false,
          "shareUsername": false,
          "sharePicture": false,
          "shareWebsite": false,
          "shareInterests": false,
          "shareCareerGoals": false,
          "shareOpportunities": false,
          "shareCourses": false,
          "shareLevel": false
        },
        {
          "username": "ella@hawaii.edu",
          "firstName": "Ella",
          "lastName": "Zwick",
          "picture": "/images/mockup/ella.jpg",
          "website": "",
          "interests": [],
          "careerGoals": [],
          "level": 1,
          "profileCourses": [],
          "profileOpportunities": [],
          "isAlumni": true,
          "retired": false,
          "shareUsername": false,
          "sharePicture": false,
          "shareWebsite": false,
          "shareInterests": false,
          "shareCareerGoals": false,
          "shareOpportunities": false,
          "shareCourses": false,
          "shareLevel": false
        },
        {
          "username": "samplestudent@hawaii.edu",
          "firstName": "Sample",
          "lastName": "Student",
          "picture": "http://res.cloudinary.com/radgrad/image/upload/v1501351007/zfrhwhcwfgddftu8z2ei.jpg",
          "website": "http://amymalia.github.io",
          "interests": [],
          "careerGoals": [],
          "level": 6,
          "profileCourses": [],
          "profileOpportunities": [],
          "isAlumni": false,
          "retired": false,
          "shareUsername": false,
          "sharePicture": false,
          "shareWebsite": false,
          "shareInterests": false,
          "shareCareerGoals": false,
          "shareOpportunities": false,
          "shareCourses": false,
          "shareLevel": false
        }]
    },
    {
      "name": "TeaserCollection",
      "contents": []
    },
    {
      "name": "UserInteractionCollection",
      "contents": []
    },
    {
      "name": "VerificationRequestCollection",
      "contents": []
    }
  ]
}
