[
  {
    "url": "https://80000hours.org/job-board/?role=frontend-engineering-intern___recb6zAw5fIFhbGIa",
    "position": "Frontend Engineering Intern",
    "company": "Ought",
    "location": {
      "city": "San Francisco Bay Area",
      "state": "N/A"
    },
    "posted": "Posted 3 months ago",
    "lastScraped": "2021-07-01T18:43:31.823Z",
    "description": "\"About the role: As a frontend engineering intern at Ought, you will be: Helping create intuitive user interfaces that let research analysts use language models as tools for thought. The role is paid.\""
  },
  {
    "url": "https://80000hours.org/job-board/?role=software-engineering-intern___recPGOrZ1g1wps1pU",
    "position": "Software Engineering Intern",
    "company": "Ought",
    "location": {
      "city": "San Francisco Bay Area",
      "state": "N/A"
    },
    "posted": "Posted 4 months ago",
    "lastScraped": "2021-07-01T18:43:35.039Z",
    "description": "\"Ought is an applied research lab building Elicit, a GPT-3-based research assistant for questions about the future. Today, researchers and policy analysts use Elicit to find relevant publications for a literature review, find datasets, or brainstorm research questions that are interesting to their audience. Researchers can define new tasks by showing Elicit just a few examples of the task being done. Elicit then scales those tasks to thousands of publications and datasets [...]"
  },
  {
    "url": "https://80000hours.org/job-board/?role=research-intern-competition-with-china___recSUSFuT8R8i9A2J",
    "position": "Research Intern, Competition with China, AI infrastructure investment, and Algorithmic Fairness",
    "company": "Schmidt Futures",
    "location": {
      "city": "New York, NY",
      "state": "N/A"
    },
    "posted": "Posted 7 months ago",
    "lastScraped": "2021-07-01T18:43:38.339Z",
    "description": "\"Many of the most pressing global policy challenges today have technical problems at their core (e.g. tech competition with China, AI infrastructure investment, global internet standards, and algorithmic fairness). Yet the top policy research groups and think tanks driving new policy ideas lack technical expertise on staff or within their networks. Solving these challenges requires technical insight, which can uniquely be produced by exceptional technical talent. We are seeking “Computer Science + policy” research interns to help build a next-generation technical strategy group from the ground up to solve this by producing cutting edge knowledge products on tech strategy questions to drive decision making for policymakers and philanthropic investment."
  },
  {
    "url": "https://80000hours.org/job-board/?role=intern-ml-technical-research___recOdYGIE8FUaet3w",
    "position": "Intern, ML Technical Research",
    "company": "Tencent",
    "location": {
      "city": "Shenzhen, China",
      "state": "N/A"
    },
    "posted": "Posted 8 months ago",
    "lastScraped": "2021-07-01T18:43:40.580Z",
    "description": "\"What is the most important thing for a researcher? Is it hundreds of millions of data, rich application scenarios, ultra-large-scale computing resources, deep technology accumulation in the full spectrum of fields, or the pursuit of the ultimate innovation atmosphere? As a research engineer in the field of natural language processing, you'll be: 1. Responsible for the research and development of natural language processing algorithms, including but not limited to semantic analysis, intention recognition, human-machine dialogue, semantic mining, machine translation, knowledge graphs, named entity recognition, etc,; 2. Responsible for the technical research of dialogue systems, especially task-oriented dialogue systems, including natural language understanding [...]\""
  },
  {
    "url": "https://80000hours.org/job-board/?role=research-intern-natural-language-and-sp___reczUzzYBbIyYFon1",
    "position": "Research Intern, Natural Language and Speech Processing",
    "company": "Tencent",
    "location": {
      "city": "Seattle metro area",
      "state": "N/A"
    },
    "posted": "Posted 8 months ago",
    "lastScraped": "2021-07-01T18:43:42.813Z",
    "description": "\"We are seeking natural language & speech processing research interns in our Seattle office located at Bellevue WA for year 2019. You will be working with researchers on a research project related to one of the core problems in natural language processing (e.g., natural language understanding and generation, question and answering, reading comprehension, and knowledge graph inference), dialog system (e.g., multi-turn, multi-modal, and multi-user dialog tracking and management), and speech recognition and synthesis (e.g., new paradigm). You will work on real and/or big data using our high-performing computing facility and are encouraged to publish the results of your internship. Key responsibilities:"
  },
  {
    "position": "Senior Manager - Copywriter (Kabbage)",
    "company": "American Express",
    "contact": "https://careers.americanexpress.com/",
    "url": "https://aexp.eightfold.ai/careers?pid=7251082&location=USA&query=Internships&domain=aexp.com",
    "lastScraped": "2021-07-01T18:43:46.223Z",
    "location": {
      "city": "N/A",
      "state": "Error",
      "country": "United States"
    },
    "description": "<div><p style=\"margin-top: 16px; margin-bottom: 16px;\"><span style=\"\"><span style=\"\">Kabbage is expanding its rock-star Marketing team with a new <b>Senior Manager, Copywriter</b> to join us as we aim to help American small businesses grow and manage their cash flow.&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;</span></span></p>\n\n<p style=\"margin-top: 16px; margin-bottom: 16px;\"><span style=\"\"><span style=\"\">Acquired by American Express in 2020, Kabbage is pairing its leading FinTech platform with the powerful backing of AMEX to launch an innovative cash-flow platform to give the smallest businesses access to cutting-edge financial tools and services. Deeply data-driven and connected with its customers, Kabbage has a full suite of cash-flow products from flexible lines of credit, online business checking accounts, payment processing, predictive business analytics and more. While we've received numerous awards and recognition—such as Entrepreneur's Top Company Cultures, Inc Magazine's Top Private Companies, GlassDoor’s Best Places to Work, and Forbes FinTech 50—it is our people, our culture, and our leaders that make Kabbage such a great place to work.</span></span></p>\n\n<p style=\"\"><span style=\"\"><span style=\"\"><b><span style=\"color:black\">Your mission:</span></b></span></span></p>\n\n<p style=\"\"><span style=\"\"><span style=\"\"><span style=\"color:black\">Create compelling copy that drives results, from acquiring new customers and increasing utilization to creating an elegant user experience and building a trusted brand. </span></span></span></p>\n\n<p style=\"\"><span style=\"\"><span style=\"\"><b><span style=\"color:black\">What you’ll be doing:</span></b></span></span></p>\n\n<ul>\n\t<li><span style=\"\"><span style=\"\"><span style=\"\"><span style=\"color:black\">The Kabbage Marketing team is always perfecting its approach to customer acquisition and engagement, and copy plays a key role. You’ll develop copy that implements the Kabbage voice, promotes brand awareness and drives response across web, email, direct mail, display, social ads, video and other content channels. </span></span></span></span></li>\n\t<li><span style=\"\"><span style=\"\"><span style=\"\"><span style=\"color:black\">You’ll support our User Experience team with technical copy that informs and engages. You’ll also work alongside the wider American Express team as the lead copy-champion for Kabbage. </span></span></span></span></li>\n\t<li><span style=\"\"><span style=\"\"><span style=\"\"><span style=\"color:black\">This is a fantastic opportunity to write copy for a variety of channels, serve as a go-to resource for Kabbage, and become embedded in a leading global brand: American Express.</span></span></span></span></li>\n</ul>\n<p style=\"\"><span style=\"\"><span style=\"\"><b>What we’re looking for in you:</b></span></span></p>\n\n<ul>\n\t<li style=\"margin-top:16px\"><span style=\"\"><span style=\"\"><b><i>Initiative:</i></b> Scrappy and able to work in a fast-paced environment. Take direction based on creative parameters and business goals and run with the assignment.</span></span></li>\n\t<li><span style=\"\"><span style=\"\"><b><i>Flexibility/Adaptability:</i></b> Adjusts quickly to changing priorities and conditions; copes effectively with complexity and change.</span></span></li>\n\t<li><span style=\"\"><span style=\"\"><b><i>Collaboration &amp; Influence: </i></b>ability to successfully influence and bring together internal and external stakeholders to achieve shared goals.</span></span></li>\n\t<li><span style=\"\"><span style=\"\"><b><i>Communication:</i></b> Able to see and communicate the big picture in an inspiring way; determines opportunities and threats through comprehensive analysis of current and future trends.</span></span></li>\n\t<li style=\"margin-bottom:16px\"><span style=\"\"><span style=\"\"><b><i>Creativity/Innovation:</i></b> Balance brand consistency with the ability to push our creative direction to keep it fresh.</span></span></li>\n</ul>\n\n<p style=\"\"><span style=\"\"><span style=\"\"><b><span style=\"color:black\">What</span> you should have:</b></span></span></p>\n\n<ul>\n\t<li style=\"border:none\"><span style=\"\"><span style=\"\">6<span style=\"color:black\">+ years of copywriting experience</span>.</span></span></li>\n\t<li><span style=\"\"><span style=\"\">Ability to write across media and types of content, including web, email, direct mail, display and social channels.</span></span></li>\n\t<li><span style=\"\"><span style=\"\">Experience writing for a multi-product organization a plus.</span></span></li>\n\t<li style=\"border:none\"><span style=\"\"><span style=\"\"><span style=\"background:white\"><span style=\"color:black\">Excellent writing, editing, and proofreading skills.</span></span></span></span></li>\n\t<li style=\"border:none\"><span style=\"\"><span style=\"\"><span style=\"color:black\">Emphasis on conversational, short-form copy that drives results.</span></span></span></li>\n\t<li style=\"border:none\"><span style=\"\"><span style=\"\">Experience creating approachable, easy-to-follow user experiences.</span></span></li>\n\t<li><span style=\"\"><span style=\"\">Ability to translate complex topics into straightforward copy.</span></span></li>\n\t<li><span style=\"\"><span style=\"\">Link to your portfolio or 5-10 of your best writing samples.</span></span></li>\n</ul>\n\n<p style=\"\"><span style=\"\"><span style=\"\"><span style=\"line-height:18pt\"><span style=\"font-weight:bold\">Additional Details:</span></span></span></span></p>\n\n<ul>\n\t<li style=\"vertical-align: middle;\"><span style=\"\"><span style=\"\">Ongoing Workplace Flexibility:&nbsp;Position will currently be work-from-home due to COVID-19.&nbsp; American Express is committed to the well-being of its colleagues and to creating a safe work environment; colleagues will continue to work remotely until a return to the office can be safely accomplished.</span></span></li>\n\t<li style=\"vertical-align: middle;\"><span style=\"\"><span style=\"\">Visa Sponsorship: Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for this position.</span></span></li>\n</ul>\n\n<div style=\"color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial; background-color: rgb(255, 255, 255);\">\n<p style=\"\"><span style=\"\"><span style=\"\">American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law.</span></span></p>\n\n<p style=\"\">&nbsp;</p>\n</div></div>"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Test-Automation-Engineer-Fall-2021-Internship-Bachelors-Meraki/1331387",
    "position": "Test Automation Engineer Fall 2021 Internship, Bachelors (Meraki)",
    "company": "Cisco",
    "location": {
      "city": "San Francisco",
      "state": "US"
    },
    "lastScraped": "2021-07-01T18:43:50.117Z",
    "description": "<p><strong>Fall Internship (August 2021 - December, full-time work schedule, Monday- Friday 40 hours per week)</strong></p><p><strong>Cisco Meraki Business Unit</strong></p> <p>Simplicity. Meraki makes setting up, managing, and maintaining networks easier than it has ever been before. Simplified and smarter networking means that businesses run more efficiently, and more people have reliable access to the information they need. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.</p><p>You will join a test automation team that is fully embedded within our software engineering team. We handle all types of testing projects for our cloud managed products; from nightly feature tests across the latest firmware images to performance testing of all kinds. We run large scale testing to measure how small changes could impact our performance. Our automation framework is being used across software engineering, and we continue to make it more intuitive. Our products are used in over a million networks and our customers rely on our products to serve ten of millions of people. With the large footprint that we have, quality is our highest priority. We are looking for the newest additions to our teams who are as passionate about quality as we are. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions. Your contributions will make direct impact to the success of our business.</p><p>Meraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and encouraging workplace where everybody is given the opportunity to succeed.</p><h2>A day in the life of Test Automation Engineering Intern:</h2><p>You may design a testbed from the ground up that has the ability to change topologies on the fly. You will have an in-house automation framework at your disposal as well as APIs to hook into for further automation. You will have the autonomy to craft and implement a solution as well as the knowledge and experience of team members to help you along the way.</p><p>In addition to software testing, you may have a chance to work on our latest hardware appliances from an early phase of development. You will get to learn some of the cool technologies inside the box. Through testing, you will gain firsthand knowledge about the performance and be able to guide the team in improving the quality before we release the product.</p><h2>What does it take?</h2><ul><li>You are pursuing a bachelors technical degree or equivalent experience with a great foundation in the fundamentals of computer science and computer networking</li><li>You are proficient in scripting languages such as Ruby or Python</li><li>You are proficient in Lunix and REST API</li><li>You have solid understanding of core network protocols like TCP/IP, DHCP, DNS, VLANS, etc.</li><li>You have experience in performance testing</li><li>You have CCNA or equivalent certification</li><li>You have familiarity with UI framework such as React/Ember/Angular</li><li>You have familiarity with IPv6 and routing protocols like OSPF and BGP</li><li>You have worked with virtualization or container technology, such as ESXi, Xen, Docker, etc.</li><li>You have used development infrastructure tools such as Jenkins, Git, Gerrit, and JIRA and/or have experience with Database solutions (e.g, InfluxDB, PostgreSQL, etc)</li></ul><h2>Intern Program Overview:</h2><p>Meraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto sub-teams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the bulk of the program on a larger project, such as building the infrastructure for a new service. Projects are multi-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.</p><p>Meraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.</p><h2>Intern Benefits:</h2><ul><li>Housing assistance in San Francisco for duration of program</li><li>Competitive salary</li><li>Weekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)</li><li>Lunch and dinner daily</li><li>Customized laptop and desk setups</li><li>Medical coverage plans</li></ul><p>Cisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.</p><p>At Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.</p>"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Full-Stack-Engineer-Fall-2021-Internship-Bachelors-Meraki/1325745",
    "position": "Full Stack Engineer Fall 2021 Internship, Bachelors (Meraki)",
    "company": "Cisco",
    "location": {
      "city": "San Francisco",
      "state": "US"
    },
    "lastScraped": "2021-07-01T18:43:50.117Z",
    "description": "<div><p><strong>Fall Internship (August - December 2021, full-time work schedule, Monday - Friday 40 hours per week)</strong></p><p><strong>Cisco Meraki Business Unit</strong></p> <p>The modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.</p><br> <p>As a Full Stack Engineer at Meraki, you will help craft and build features for Meraki's Dashboard - the window to the entire Meraki experience. From Dashboard, our customers can control their entire Meraki stack: access points, switches, firewalls, client devices, cameras, and more. You will work across the stack with other developers, UX designers, and product management to build and improve the Dashboard web application. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions.</p><br> <p>Meraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and supportive workplace where everybody is given the opportunity to succeed.</p><br> <h2 id=\"JD:Intern-Full_Stack-FY19Q1-ExampleprojectsofaFullStackWebDeveloperIntern:\"><strong>Example projects of a Full Stack Web Developer Intern:</strong></h2> <ul> <li>Create services to fetch data from millions of Meraki devices, then present that data in a user-friendly way</li> <li>Improve performance and efficiency of our backend, allowing us to handle increasingly large datasets with minimal delay</li> <li>Build internal frameworks and refine front end infrastructure to augment developer productivity</li> <li>Construct API endpoints to allow Meraki users and third party companies to build custom tools and features</li> <li>Build a dashboard for anomaly / outlier detection on network traffic using machine learning algorithms</li> <li>Build a graph for network traffic analysis using clustering and other algorithms</li> </ul> <h2 id=\"JD:Intern-Full_Stack-FY20Q1-Youareanoutstandingapplicantif:\"><strong>You</strong>&nbsp;<strong>are</strong>&nbsp;<strong>an</strong>&nbsp;<strong>outstanding</strong>&nbsp;<strong>applicant</strong>&nbsp;<strong>if:</strong></h2> <ul> <li>You are pursuing a technical bachelors degree or have equivalent experience with a strong foundation in the fundamentals of computer science</li> <li>You strive to build rich and dynamic web applications with front-end frameworks such as React, Redux, Ember, or Angular</li> <li>You are familiar with programming languages and web frameworks like Ruby (Rails, EventMachine), Python (Django, Flask), or Node.js (Express)</li> <li>You have worked with SQL and relational Databases</li> <li>You would flourish within a small engineering team and are excited to tackle open-ended problems</li> </ul> <h2 id=\"JD:Intern-Full_Stack-FY19Q1-Intern/Co-OpProgramOverview:\"><strong>Intern Program Overview:</strong></h2> <p>Meraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.</p><br> <p>Meraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. &nbsp;Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.</p><br> <h2 id=\"JD:Intern-Full_Stack-FY19Q1-Intern/Co-OpBenefits:\"><strong>Intern Benefits:</strong></h2> <ul> <li> <p>Housing Assistance</p> </li> <li> <p>Competitive salary</p> </li> <li> <p>Weekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)</p> </li> <li> <p>Lunch and dinner daily</p> </li> <li> <p>Customized laptop and desk setups</p> </li> <li> <p>Medical coverage plan</p> </li> </ul> <p><em>Cisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.</em></p><br> <p><em>At Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.</em></p></div>"
  },
  {
    "position": "Apple Cloud Platform - Internal CI/CD Service & Tools",
    "company": "Apple",
    "location": {
      "city": "Cupertino",
      "state": "CA"
    },
    "posted": "2021-06-25T18:43:31.576Z",
    "url": "https://stackoverflow.com/jobs/517321/apple-cloud-platform-internal-ci-cd-service-apple?a=2NuARwdSMw9i&so=i&pg=1&offset=0&total=15&so_medium=Internal&so_source=JobSearch&q=internship",
    "skills": [
      "design"
    ],
    "lastScraped": "2021-07-01T18:43:31.576Z",
    "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\nAre you a service developer looking to grow your skill set, invent new technology, and make a difference in developer productivity for thousands of developers inside all parts of Apple? \nThe Software Development Productivity team builds services and tools to help developers get ideas from commit to production quickly and with confidence. We’re constantly improving our existing CI/CD service to give developers the building blocks they need to produce scalable, high performance build and deploy pipelines with minimal friction. Our services power an enormous number of builds per day across all of Apple, including some of the most well known customer facing properties, and we want to do even more. \nOur engineering team is committed to innovating and pushing the bounds of continuous delivery. We ship to customers frequently and constantly strive to improve our delivery. Improving means constantly learning and making mistakes, something our team embraces. \nWe believe that the role of a developer is not to produce code, but tackle problems. This means asking a lot of questions, understanding and empathizing with customers, and helping make the hard choices about what to build.<br><br><span>YOU’LL DO WELL IN THIS ROLE IF YOU:\n-  Are driven to create outstanding customer experiences, and are passionate about helping developers write better code faster.\n\n-  Are good at understanding an entire customer problem and applying technology to it\n\n-  Love teaching people and learning new things\n\n-  Are not afraid to ask the hard questions or express your opinions, even when they are controversial.\n\n-  Enjoy evolving a large, critical system to provide next generation features</span>            </div>"
  },
  {
    "position": "QA Intern for enterprise consumer facing sites",
    "company": "Hearst Magazines",
    "location": {
      "city": "Chicago",
      "state": "IL"
    },
    "posted": "2021-06-06T18:43:36.950Z",
    "url": "https://stackoverflow.com/jobs/526759/qa-intern-for-enterprise-consumer-facing-sites-hearst-magazines?a=2QEPMhWUhPOw&so=i&pg=1&offset=1&total=15&so_medium=Internal&so_source=JobSearch&q=internship",
    "skills": [],
    "lastScraped": "2021-07-01T18:43:36.950Z",
    "description": "<h2 class=\"fs-subheading mb16 fc-dark\">Job description</h2>\n            <div>\n<p>iCrossing a digital agency owned by Hearts Magazines Division.   Our technology team creates world-class data-driven solutions for Omni-channel digital marketing initiatives. We’re engineers, and solutions integrators experienced at all levels of the application development lifecycle with a clear focus on creating engaging, rich and dynamic customer experiences. Keeping up with the proliferation of devices, operating systems and APIs takes some serious technical talent – and our team has lots of it. No matter what their individual role, every team member has two basic responsibilities: Build technologies that power digital transformations and make the impossible, possible.</p>\n<p>As an intern working with our QA Leadership, you will have a chance to work on large consumer facing sites to ensure that our technical deliverables are of the highest quality.  You will be exposed to a variety of teams that work together to produce world class consumer facing sites. </p>\n<p><strong>What you’ll do and learn:</strong></p>\n<ul>\n<li>You will work with QA and Tech Leads to insure technical work is following the defined processes. You will see how QA functions within agile process for large scale web projects.</li>\n<li>You will participate in Test Case development according to project specifications. You will learn how to create test cases that will be used by others.</li>\n<li>You will execute the test cases and automated scripts required for the project. You will have a chance to practice scripting skills</li>\n<li>Analyze test automation execution results and provide execution summary.</li>\n<li>You will record results and communicate defects via bug tracking tools and validate defects once they are fixed.</li>\n<li>You will Provide test execution progress reports and test result reports.</li>\n<li>You will work with debugging tools as required by the project. </li>\n</ul>\n<p> <strong>Who you are</strong></p>\n<ul>\n<li> You have a knowledge and interest in web technologies, web design, internet protocols, operating systems, and relational databases</li>\n<li>You have an understanding of HTML, CSS, XML, JSON, HTTP/S), social media platforms, and mobile devices.</li>\n<li>You may have taken a course in Java and/or have basic Java development skills in Java</li>\n<li>You are detail oriented</li>\n<li>You are methodical when solving a problem</li>\n</ul>            </div>"
  }
]
